Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_bf.h
/**
 * \file IfxCan_bf.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 *
 * Date: 2015-12-17 16:15:11 GMT
 * Version: TBD
 * Specification: TBD
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Can_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxLld_Can_Registers
 * 
 */
#ifndef IFXCAN_BF_H
#define IFXCAN_BF_H 1
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Can_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_CAN_CLC_Bits.DISR */
#define IFX_CAN_CLC_DISR_LEN (1u)

/** \brief Mask for Ifx_CAN_CLC_Bits.DISR */
#define IFX_CAN_CLC_DISR_MSK (0x1u)

/** \brief Offset for Ifx_CAN_CLC_Bits.DISR */
#define IFX_CAN_CLC_DISR_OFF (0u)

/** \brief Length for Ifx_CAN_CLC_Bits.DISS */
#define IFX_CAN_CLC_DISS_LEN (1u)

/** \brief Mask for Ifx_CAN_CLC_Bits.DISS */
#define IFX_CAN_CLC_DISS_MSK (0x1u)

/** \brief Offset for Ifx_CAN_CLC_Bits.DISS */
#define IFX_CAN_CLC_DISS_OFF (1u)

/** \brief Length for Ifx_CAN_CLC_Bits.EDIS */
#define IFX_CAN_CLC_EDIS_LEN (1u)

/** \brief Mask for Ifx_CAN_CLC_Bits.EDIS */
#define IFX_CAN_CLC_EDIS_MSK (0x1u)

/** \brief Offset for Ifx_CAN_CLC_Bits.EDIS */
#define IFX_CAN_CLC_EDIS_OFF (3u)

/** \brief Length for Ifx_CAN_ID_Bits.MOD_REV */
#define IFX_CAN_ID_MOD_REV_LEN (8u)

/** \brief Mask for Ifx_CAN_ID_Bits.MOD_REV */
#define IFX_CAN_ID_MOD_REV_MSK (0x0u)

/** \brief Offset for Ifx_CAN_ID_Bits.MOD_REV */
#define IFX_CAN_ID_MOD_REV_OFF (0u)

/** \brief Length for Ifx_CAN_ID_Bits.MOD_TYPE */
#define IFX_CAN_ID_MOD_TYPE_LEN (8u)

/** \brief Mask for Ifx_CAN_ID_Bits.MOD_TYPE */
#define IFX_CAN_ID_MOD_TYPE_MSK (0xffu)

/** \brief Offset for Ifx_CAN_ID_Bits.MOD_TYPE */
#define IFX_CAN_ID_MOD_TYPE_OFF (8u)

/** \brief Length for Ifx_CAN_ID_Bits.MOD_NUMBER */
#define IFX_CAN_ID_MOD_NUMBER_LEN (16u)

/** \brief Mask for Ifx_CAN_ID_Bits.MOD_NUMBER */
#define IFX_CAN_ID_MOD_NUMBER_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_ID_Bits.MOD_NUMBER */
#define IFX_CAN_ID_MOD_NUMBER_OFF (16u)

/** \brief Length for Ifx_CAN_GRINT1_Bits.TEFIFO */
#define IFX_CAN_GRINT1_TEFIFO_LEN (4u)

/** \brief Mask for Ifx_CAN_GRINT1_Bits.TEFIFO */
#define IFX_CAN_GRINT1_TEFIFO_MSK (0xfu)

/** \brief Offset for Ifx_CAN_GRINT1_Bits.TEFIFO */
#define IFX_CAN_GRINT1_TEFIFO_OFF (0u)

/** \brief Length for Ifx_CAN_GRINT1_Bits.HPE */
#define IFX_CAN_GRINT1_HPE_LEN (4u)

/** \brief Mask for Ifx_CAN_GRINT1_Bits.HPE */
#define IFX_CAN_GRINT1_HPE_MSK (0xfu)

/** \brief Offset for Ifx_CAN_GRINT1_Bits.HPE */
#define IFX_CAN_GRINT1_HPE_OFF (4u)

/** \brief Length for Ifx_CAN_GRINT1_Bits.WATI */
#define IFX_CAN_GRINT1_WATI_LEN (4u)

/** \brief Mask for Ifx_CAN_GRINT1_Bits.WATI */
#define IFX_CAN_GRINT1_WATI_MSK (0xfu)

/** \brief Offset for Ifx_CAN_GRINT1_Bits.WATI */
#define IFX_CAN_GRINT1_WATI_OFF (8u)

/** \brief Length for Ifx_CAN_GRINT1_Bits.ALRT */
#define IFX_CAN_GRINT1_ALRT_LEN (4u)

/** \brief Mask for Ifx_CAN_GRINT1_Bits.ALRT */
#define IFX_CAN_GRINT1_ALRT_MSK (0xfu)

/** \brief Offset for Ifx_CAN_GRINT1_Bits.ALRT */
#define IFX_CAN_GRINT1_ALRT_OFF (12u)

/** \brief Length for Ifx_CAN_GRINT1_Bits.MOER */
#define IFX_CAN_GRINT1_MOER_LEN (4u)

/** \brief Mask for Ifx_CAN_GRINT1_Bits.MOER */
#define IFX_CAN_GRINT1_MOER_MSK (0xfu)

/** \brief Offset for Ifx_CAN_GRINT1_Bits.MOER */
#define IFX_CAN_GRINT1_MOER_OFF (16u)

/** \brief Length for Ifx_CAN_GRINT1_Bits.SAFE */
#define IFX_CAN_GRINT1_SAFE_LEN (4u)

/** \brief Mask for Ifx_CAN_GRINT1_Bits.SAFE */
#define IFX_CAN_GRINT1_SAFE_MSK (0xfu)

/** \brief Offset for Ifx_CAN_GRINT1_Bits.SAFE */
#define IFX_CAN_GRINT1_SAFE_OFF (20u)

/** \brief Length for Ifx_CAN_GRINT1_Bits.BOFF */
#define IFX_CAN_GRINT1_BOFF_LEN (4u)

/** \brief Mask for Ifx_CAN_GRINT1_Bits.BOFF */
#define IFX_CAN_GRINT1_BOFF_MSK (0xfu)

/** \brief Offset for Ifx_CAN_GRINT1_Bits.BOFF */
#define IFX_CAN_GRINT1_BOFF_OFF (24u)

/** \brief Length for Ifx_CAN_GRINT1_Bits.LOI */
#define IFX_CAN_GRINT1_LOI_LEN (4u)

/** \brief Mask for Ifx_CAN_GRINT1_Bits.LOI */
#define IFX_CAN_GRINT1_LOI_MSK (0xfu)

/** \brief Offset for Ifx_CAN_GRINT1_Bits.LOI */
#define IFX_CAN_GRINT1_LOI_OFF (28u)

/** \brief Length for Ifx_CAN_GRINT2_Bits.REINT */
#define IFX_CAN_GRINT2_REINT_LEN (4u)

/** \brief Mask for Ifx_CAN_GRINT2_Bits.REINT */
#define IFX_CAN_GRINT2_REINT_MSK (0xfu)

/** \brief Offset for Ifx_CAN_GRINT2_Bits.REINT */
#define IFX_CAN_GRINT2_REINT_OFF (0u)

/** \brief Length for Ifx_CAN_GRINT2_Bits.RxF1F */
#define IFX_CAN_GRINT2_RXF1F_LEN (4u)

/** \brief Mask for Ifx_CAN_GRINT2_Bits.RxF1F */
#define IFX_CAN_GRINT2_RXF1F_MSK (0xfu)

/** \brief Offset for Ifx_CAN_GRINT2_Bits.RxF1F */
#define IFX_CAN_GRINT2_RXF1F_OFF (4u)

/** \brief Length for Ifx_CAN_GRINT2_Bits.RxF0F */
#define IFX_CAN_GRINT2_RXF0F_LEN (4u)

/** \brief Mask for Ifx_CAN_GRINT2_Bits.RxF0F */
#define IFX_CAN_GRINT2_RXF0F_MSK (0xfu)

/** \brief Offset for Ifx_CAN_GRINT2_Bits.RxF0F */
#define IFX_CAN_GRINT2_RXF0F_OFF (8u)

/** \brief Length for Ifx_CAN_GRINT2_Bits.RxF1N */
#define IFX_CAN_GRINT2_RXF1N_LEN (4u)

/** \brief Mask for Ifx_CAN_GRINT2_Bits.RxF1N */
#define IFX_CAN_GRINT2_RXF1N_MSK (0xfu)

/** \brief Offset for Ifx_CAN_GRINT2_Bits.RxF1N */
#define IFX_CAN_GRINT2_RXF1N_OFF (12u)

