Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_bf.h
/** \brief Length for Ifx_CAN_GRINT2_Bits.RxF0N */
#define IFX_CAN_GRINT2_RXF0N_LEN (4u)

/** \brief Mask for Ifx_CAN_GRINT2_Bits.RxF0N */
#define IFX_CAN_GRINT2_RXF0N_MSK (0xfu)

/** \brief Offset for Ifx_CAN_GRINT2_Bits.RxF0N */
#define IFX_CAN_GRINT2_RXF0N_OFF (16u)

/** \brief Length for Ifx_CAN_GRINT2_Bits.RETI */
#define IFX_CAN_GRINT2_RETI_LEN (4u)

/** \brief Mask for Ifx_CAN_GRINT2_Bits.RETI */
#define IFX_CAN_GRINT2_RETI_MSK (0xfu)

/** \brief Offset for Ifx_CAN_GRINT2_Bits.RETI */
#define IFX_CAN_GRINT2_RETI_OFF (20u)

/** \brief Length for Ifx_CAN_GRINT2_Bits.TRAQ */
#define IFX_CAN_GRINT2_TRAQ_LEN (4u)

/** \brief Mask for Ifx_CAN_GRINT2_Bits.TRAQ */
#define IFX_CAN_GRINT2_TRAQ_MSK (0xfu)

/** \brief Offset for Ifx_CAN_GRINT2_Bits.TRAQ */
#define IFX_CAN_GRINT2_TRAQ_OFF (24u)

/** \brief Length for Ifx_CAN_GRINT2_Bits.TRACO */
#define IFX_CAN_GRINT2_TRACO_LEN (4u)

/** \brief Mask for Ifx_CAN_GRINT2_Bits.TRACO */
#define IFX_CAN_GRINT2_TRACO_MSK (0xfu)

/** \brief Offset for Ifx_CAN_GRINT2_Bits.TRACO */
#define IFX_CAN_GRINT2_TRACO_OFF (28u)

/** \brief Length for Ifx_CAN_MCR_Bits.CLKSEL0 */
#define IFX_CAN_MCR_CLKSEL0_LEN (2u)

/** \brief Mask for Ifx_CAN_MCR_Bits.CLKSEL0 */
#define IFX_CAN_MCR_CLKSEL0_MSK (0x3u)

/** \brief Offset for Ifx_CAN_MCR_Bits.CLKSEL0 */
#define IFX_CAN_MCR_CLKSEL0_OFF (0u)

/** \brief Length for Ifx_CAN_MCR_Bits.CLKSEL1 */
#define IFX_CAN_MCR_CLKSEL1_LEN (2u)

/** \brief Mask for Ifx_CAN_MCR_Bits.CLKSEL1 */
#define IFX_CAN_MCR_CLKSEL1_MSK (0x3u)

/** \brief Offset for Ifx_CAN_MCR_Bits.CLKSEL1 */
#define IFX_CAN_MCR_CLKSEL1_OFF (2u)

/** \brief Length for Ifx_CAN_MCR_Bits.CLKSEL2 */
#define IFX_CAN_MCR_CLKSEL2_LEN (2u)

/** \brief Mask for Ifx_CAN_MCR_Bits.CLKSEL2 */
#define IFX_CAN_MCR_CLKSEL2_MSK (0x3u)

/** \brief Offset for Ifx_CAN_MCR_Bits.CLKSEL2 */
#define IFX_CAN_MCR_CLKSEL2_OFF (4u)

/** \brief Length for Ifx_CAN_MCR_Bits.CLKSEL3 */
#define IFX_CAN_MCR_CLKSEL3_LEN (2u)

/** \brief Mask for Ifx_CAN_MCR_Bits.CLKSEL3 */
#define IFX_CAN_MCR_CLKSEL3_MSK (0x3u)

/** \brief Offset for Ifx_CAN_MCR_Bits.CLKSEL3 */
#define IFX_CAN_MCR_CLKSEL3_OFF (6u)

/** \brief Length for Ifx_CAN_MCR_Bits.NODE */
#define IFX_CAN_MCR_NODE_LEN (3u)

/** \brief Mask for Ifx_CAN_MCR_Bits.NODE */
#define IFX_CAN_MCR_NODE_MSK (0x7u)

/** \brief Offset for Ifx_CAN_MCR_Bits.NODE */
#define IFX_CAN_MCR_NODE_OFF (24u)

/** \brief Length for Ifx_CAN_MCR_Bits.DXCM */
#define IFX_CAN_MCR_DXCM_LEN (1u)

/** \brief Mask for Ifx_CAN_MCR_Bits.DXCM */
#define IFX_CAN_MCR_DXCM_MSK (0x1u)

/** \brief Offset for Ifx_CAN_MCR_Bits.DXCM */
#define IFX_CAN_MCR_DXCM_OFF (27u)

/** \brief Length for Ifx_CAN_MCR_Bits.RBUSY */
#define IFX_CAN_MCR_RBUSY_LEN (1u)

/** \brief Mask for Ifx_CAN_MCR_Bits.RBUSY */
#define IFX_CAN_MCR_RBUSY_MSK (0x1u)

/** \brief Offset for Ifx_CAN_MCR_Bits.RBUSY */
#define IFX_CAN_MCR_RBUSY_OFF (28u)

/** \brief Length for Ifx_CAN_MCR_Bits.RINIT */
#define IFX_CAN_MCR_RINIT_LEN (1u)

/** \brief Mask for Ifx_CAN_MCR_Bits.RINIT */
#define IFX_CAN_MCR_RINIT_MSK (0x1u)

/** \brief Offset for Ifx_CAN_MCR_Bits.RINIT */
#define IFX_CAN_MCR_RINIT_OFF (29u)

/** \brief Length for Ifx_CAN_MCR_Bits.CI */
#define IFX_CAN_MCR_CI_LEN (1u)

/** \brief Mask for Ifx_CAN_MCR_Bits.CI */
#define IFX_CAN_MCR_CI_MSK (0x1u)

/** \brief Offset for Ifx_CAN_MCR_Bits.CI */
#define IFX_CAN_MCR_CI_OFF (30u)

/** \brief Length for Ifx_CAN_MCR_Bits.CCCE */
#define IFX_CAN_MCR_CCCE_LEN (1u)

/** \brief Mask for Ifx_CAN_MCR_Bits.CCCE */
#define IFX_CAN_MCR_CCCE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_MCR_Bits.CCCE */
#define IFX_CAN_MCR_CCCE_OFF (31u)

/** \brief Length for Ifx_CAN_BUFADR_Bits.TXBUF */
#define IFX_CAN_BUFADR_TXBUF_LEN (14u)

/** \brief Mask for Ifx_CAN_BUFADR_Bits.TXBUF */
#define IFX_CAN_BUFADR_TXBUF_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_BUFADR_Bits.TXBUF */
#define IFX_CAN_BUFADR_TXBUF_OFF (0u)

/** \brief Length for Ifx_CAN_BUFADR_Bits.RXBUF */
#define IFX_CAN_BUFADR_RXBUF_LEN (14u)

/** \brief Mask for Ifx_CAN_BUFADR_Bits.RXBUF */
#define IFX_CAN_BUFADR_RXBUF_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_BUFADR_Bits.RXBUF */
#define IFX_CAN_BUFADR_RXBUF_OFF (16u)

/** \brief Length for Ifx_CAN_MECR_Bits.TH */
#define IFX_CAN_MECR_TH_LEN (16u)

/** \brief Mask for Ifx_CAN_MECR_Bits.TH */
#define IFX_CAN_MECR_TH_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_MECR_Bits.TH */
#define IFX_CAN_MECR_TH_OFF (0u)

/** \brief Length for Ifx_CAN_MECR_Bits.INP */
#define IFX_CAN_MECR_INP_LEN (4u)

/** \brief Mask for Ifx_CAN_MECR_Bits.INP */
#define IFX_CAN_MECR_INP_MSK (0xfu)

/** \brief Offset for Ifx_CAN_MECR_Bits.INP */
#define IFX_CAN_MECR_INP_OFF (16u)

/** \brief Length for Ifx_CAN_MECR_Bits.NODE */
#define IFX_CAN_MECR_NODE_LEN (3u)

/** \brief Mask for Ifx_CAN_MECR_Bits.NODE */
#define IFX_CAN_MECR_NODE_MSK (0x7u)

/** \brief Offset for Ifx_CAN_MECR_Bits.NODE */
#define IFX_CAN_MECR_NODE_OFF (20u)

/** \brief Length for Ifx_CAN_MECR_Bits.ANYED */
#define IFX_CAN_MECR_ANYED_LEN (1u)

/** \brief Mask for Ifx_CAN_MECR_Bits.ANYED */
#define IFX_CAN_MECR_ANYED_MSK (0x1u)

/** \brief Offset for Ifx_CAN_MECR_Bits.ANYED */
#define IFX_CAN_MECR_ANYED_OFF (24u)

/** \brief Length for Ifx_CAN_MECR_Bits.CAPEIE */
#define IFX_CAN_MECR_CAPEIE_LEN (1u)

/** \brief Mask for Ifx_CAN_MECR_Bits.CAPEIE */
#define IFX_CAN_MECR_CAPEIE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_MECR_Bits.CAPEIE */
#define IFX_CAN_MECR_CAPEIE_OFF (25u)

/** \brief Length for Ifx_CAN_MECR_Bits.DEPTH */
#define IFX_CAN_MECR_DEPTH_LEN (3u)

/** \brief Mask for Ifx_CAN_MECR_Bits.DEPTH */
#define IFX_CAN_MECR_DEPTH_MSK (0x7u)

/** \brief Offset for Ifx_CAN_MECR_Bits.DEPTH */
#define IFX_CAN_MECR_DEPTH_OFF (27u)

/** \brief Length for Ifx_CAN_MECR_Bits.SOF */
#define IFX_CAN_MECR_SOF_LEN (1u)

/** \brief Mask for Ifx_CAN_MECR_Bits.SOF */
#define IFX_CAN_MECR_SOF_MSK (0x1u)

/** \brief Offset for Ifx_CAN_MECR_Bits.SOF */
#define IFX_CAN_MECR_SOF_OFF (30u)

/** \brief Length for Ifx_CAN_MESTAT_Bits.CAPT */
#define IFX_CAN_MESTAT_CAPT_LEN (16u)

/** \brief Mask for Ifx_CAN_MESTAT_Bits.CAPT */
#define IFX_CAN_MESTAT_CAPT_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_MESTAT_Bits.CAPT */
#define IFX_CAN_MESTAT_CAPT_OFF (0u)

/** \brief Length for Ifx_CAN_MESTAT_Bits.CAPRED */
#define IFX_CAN_MESTAT_CAPRED_LEN (1u)

/** \brief Mask for Ifx_CAN_MESTAT_Bits.CAPRED */
#define IFX_CAN_MESTAT_CAPRED_MSK (0x1u)

/** \brief Offset for Ifx_CAN_MESTAT_Bits.CAPRED */
#define IFX_CAN_MESTAT_CAPRED_OFF (16u)

/** \brief Length for Ifx_CAN_MESTAT_Bits.CAPE */
#define IFX_CAN_MESTAT_CAPE_LEN (1u)

/** \brief Mask for Ifx_CAN_MESTAT_Bits.CAPE */
#define IFX_CAN_MESTAT_CAPE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_MESTAT_Bits.CAPE */
#define IFX_CAN_MESTAT_CAPE_OFF (17u)

/** \brief Length for Ifx_CAN_ACCENCTR0_Bits.EN0 */
#define IFX_CAN_ACCENCTR0_EN0_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCENCTR0_Bits.EN0 */
#define IFX_CAN_ACCENCTR0_EN0_MSK (0x1u)

