Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_bf.h
/** \brief Length for Ifx_CAN_ACCEN0_Bits.EN29 */
#define IFX_CAN_ACCEN0_EN29_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCEN0_Bits.EN29 */
#define IFX_CAN_ACCEN0_EN29_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCEN0_Bits.EN29 */
#define IFX_CAN_ACCEN0_EN29_OFF (29u)

/** \brief Length for Ifx_CAN_ACCEN0_Bits.EN30 */
#define IFX_CAN_ACCEN0_EN30_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCEN0_Bits.EN30 */
#define IFX_CAN_ACCEN0_EN30_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCEN0_Bits.EN30 */
#define IFX_CAN_ACCEN0_EN30_OFF (30u)

/** \brief Length for Ifx_CAN_ACCEN0_Bits.EN31 */
#define IFX_CAN_ACCEN0_EN31_LEN (1u)

/** \brief Mask for Ifx_CAN_ACCEN0_Bits.EN31 */
#define IFX_CAN_ACCEN0_EN31_MSK (0x1u)

/** \brief Offset for Ifx_CAN_ACCEN0_Bits.EN31 */
#define IFX_CAN_ACCEN0_EN31_OFF (31u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN0 */
#define IFX_CAN_N_ACCENNODE0__EN0_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN0 */
#define IFX_CAN_N_ACCENNODE0__EN0_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN0 */
#define IFX_CAN_N_ACCENNODE0__EN0_OFF (0u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN1 */
#define IFX_CAN_N_ACCENNODE0__EN1_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN1 */
#define IFX_CAN_N_ACCENNODE0__EN1_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN1 */
#define IFX_CAN_N_ACCENNODE0__EN1_OFF (1u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN2 */
#define IFX_CAN_N_ACCENNODE0__EN2_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN2 */
#define IFX_CAN_N_ACCENNODE0__EN2_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN2 */
#define IFX_CAN_N_ACCENNODE0__EN2_OFF (2u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN3 */
#define IFX_CAN_N_ACCENNODE0__EN3_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN3 */
#define IFX_CAN_N_ACCENNODE0__EN3_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN3 */
#define IFX_CAN_N_ACCENNODE0__EN3_OFF (3u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN4 */
#define IFX_CAN_N_ACCENNODE0__EN4_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN4 */
#define IFX_CAN_N_ACCENNODE0__EN4_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN4 */
#define IFX_CAN_N_ACCENNODE0__EN4_OFF (4u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN5 */
#define IFX_CAN_N_ACCENNODE0__EN5_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN5 */
#define IFX_CAN_N_ACCENNODE0__EN5_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN5 */
#define IFX_CAN_N_ACCENNODE0__EN5_OFF (5u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN6 */
#define IFX_CAN_N_ACCENNODE0__EN6_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN6 */
#define IFX_CAN_N_ACCENNODE0__EN6_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN6 */
#define IFX_CAN_N_ACCENNODE0__EN6_OFF (6u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN7 */
#define IFX_CAN_N_ACCENNODE0__EN7_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN7 */
#define IFX_CAN_N_ACCENNODE0__EN7_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN7 */
#define IFX_CAN_N_ACCENNODE0__EN7_OFF (7u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN8 */
#define IFX_CAN_N_ACCENNODE0__EN8_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN8 */
#define IFX_CAN_N_ACCENNODE0__EN8_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN8 */
#define IFX_CAN_N_ACCENNODE0__EN8_OFF (8u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN9 */
#define IFX_CAN_N_ACCENNODE0__EN9_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN9 */
#define IFX_CAN_N_ACCENNODE0__EN9_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN9 */
#define IFX_CAN_N_ACCENNODE0__EN9_OFF (9u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN10 */
#define IFX_CAN_N_ACCENNODE0__EN10_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN10 */
#define IFX_CAN_N_ACCENNODE0__EN10_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN10 */
#define IFX_CAN_N_ACCENNODE0__EN10_OFF (10u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN11 */
#define IFX_CAN_N_ACCENNODE0__EN11_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN11 */
#define IFX_CAN_N_ACCENNODE0__EN11_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN11 */
#define IFX_CAN_N_ACCENNODE0__EN11_OFF (11u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN12 */
#define IFX_CAN_N_ACCENNODE0__EN12_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN12 */
#define IFX_CAN_N_ACCENNODE0__EN12_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN12 */
#define IFX_CAN_N_ACCENNODE0__EN12_OFF (12u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN13 */
#define IFX_CAN_N_ACCENNODE0__EN13_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN13 */
#define IFX_CAN_N_ACCENNODE0__EN13_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN13 */
#define IFX_CAN_N_ACCENNODE0__EN13_OFF (13u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN14 */
#define IFX_CAN_N_ACCENNODE0__EN14_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN14 */
#define IFX_CAN_N_ACCENNODE0__EN14_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN14 */
#define IFX_CAN_N_ACCENNODE0__EN14_OFF (14u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN15 */
#define IFX_CAN_N_ACCENNODE0__EN15_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN15 */
#define IFX_CAN_N_ACCENNODE0__EN15_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN15 */
#define IFX_CAN_N_ACCENNODE0__EN15_OFF (15u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN16 */
#define IFX_CAN_N_ACCENNODE0__EN16_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN16 */
#define IFX_CAN_N_ACCENNODE0__EN16_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN16 */
#define IFX_CAN_N_ACCENNODE0__EN16_OFF (16u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN17 */
#define IFX_CAN_N_ACCENNODE0__EN17_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN17 */
#define IFX_CAN_N_ACCENNODE0__EN17_MSK (0x1u)

