Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_bf.h
/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN17 */
#define IFX_CAN_N_ACCENNODE0__EN17_OFF (17u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN18 */
#define IFX_CAN_N_ACCENNODE0__EN18_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN18 */
#define IFX_CAN_N_ACCENNODE0__EN18_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN18 */
#define IFX_CAN_N_ACCENNODE0__EN18_OFF (18u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN19 */
#define IFX_CAN_N_ACCENNODE0__EN19_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN19 */
#define IFX_CAN_N_ACCENNODE0__EN19_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN19 */
#define IFX_CAN_N_ACCENNODE0__EN19_OFF (19u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN20 */
#define IFX_CAN_N_ACCENNODE0__EN20_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN20 */
#define IFX_CAN_N_ACCENNODE0__EN20_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN20 */
#define IFX_CAN_N_ACCENNODE0__EN20_OFF (20u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN21 */
#define IFX_CAN_N_ACCENNODE0__EN21_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN21 */
#define IFX_CAN_N_ACCENNODE0__EN21_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN21 */
#define IFX_CAN_N_ACCENNODE0__EN21_OFF (21u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN22 */
#define IFX_CAN_N_ACCENNODE0__EN22_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN22 */
#define IFX_CAN_N_ACCENNODE0__EN22_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN22 */
#define IFX_CAN_N_ACCENNODE0__EN22_OFF (22u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN23 */
#define IFX_CAN_N_ACCENNODE0__EN23_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN23 */
#define IFX_CAN_N_ACCENNODE0__EN23_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN23 */
#define IFX_CAN_N_ACCENNODE0__EN23_OFF (23u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN24 */
#define IFX_CAN_N_ACCENNODE0__EN24_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN24 */
#define IFX_CAN_N_ACCENNODE0__EN24_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN24 */
#define IFX_CAN_N_ACCENNODE0__EN24_OFF (24u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN25 */
#define IFX_CAN_N_ACCENNODE0__EN25_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN25 */
#define IFX_CAN_N_ACCENNODE0__EN25_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN25 */
#define IFX_CAN_N_ACCENNODE0__EN25_OFF (25u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN26 */
#define IFX_CAN_N_ACCENNODE0__EN26_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN26 */
#define IFX_CAN_N_ACCENNODE0__EN26_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN26 */
#define IFX_CAN_N_ACCENNODE0__EN26_OFF (26u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN27 */
#define IFX_CAN_N_ACCENNODE0__EN27_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN27 */
#define IFX_CAN_N_ACCENNODE0__EN27_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN27 */
#define IFX_CAN_N_ACCENNODE0__EN27_OFF (27u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN28 */
#define IFX_CAN_N_ACCENNODE0__EN28_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN28 */
#define IFX_CAN_N_ACCENNODE0__EN28_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN28 */
#define IFX_CAN_N_ACCENNODE0__EN28_OFF (28u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN29 */
#define IFX_CAN_N_ACCENNODE0__EN29_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN29 */
#define IFX_CAN_N_ACCENNODE0__EN29_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN29 */
#define IFX_CAN_N_ACCENNODE0__EN29_OFF (29u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN30 */
#define IFX_CAN_N_ACCENNODE0__EN30_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN30 */
#define IFX_CAN_N_ACCENNODE0__EN30_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN30 */
#define IFX_CAN_N_ACCENNODE0__EN30_OFF (30u)

/** \brief Length for Ifx_CAN_N_ACCENNODE0__Bits.EN31 */
#define IFX_CAN_N_ACCENNODE0__EN31_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ACCENNODE0__Bits.EN31 */
#define IFX_CAN_N_ACCENNODE0__EN31_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ACCENNODE0__Bits.EN31 */
#define IFX_CAN_N_ACCENNODE0__EN31_OFF (31u)

/** \brief Length for Ifx_CAN_N_STARTADR_Bits.START */
#define IFX_CAN_N_STARTADR_START_LEN (14u)

/** \brief Mask for Ifx_CAN_N_STARTADR_Bits.START */
#define IFX_CAN_N_STARTADR_START_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_N_STARTADR_Bits.START */
#define IFX_CAN_N_STARTADR_START_OFF (2u)

/** \brief Length for Ifx_CAN_N_ENDADR_Bits.END */
#define IFX_CAN_N_ENDADR_END_LEN (14u)

/** \brief Mask for Ifx_CAN_N_ENDADR_Bits.END */
#define IFX_CAN_N_ENDADR_END_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_N_ENDADR_Bits.END */
#define IFX_CAN_N_ENDADR_END_OFF (2u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.REINT */
#define IFX_CAN_N_ISREG_REINT_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.REINT */
#define IFX_CAN_N_ISREG_REINT_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.REINT */
#define IFX_CAN_N_ISREG_REINT_OFF (0u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.RxF1F */
#define IFX_CAN_N_ISREG_RXF1F_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.RxF1F */
#define IFX_CAN_N_ISREG_RXF1F_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.RxF1F */
#define IFX_CAN_N_ISREG_RXF1F_OFF (1u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.RxF0F */
#define IFX_CAN_N_ISREG_RXF0F_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.RxF0F */
#define IFX_CAN_N_ISREG_RXF0F_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.RxF0F */
#define IFX_CAN_N_ISREG_RXF0F_OFF (2u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.RxF1N */
#define IFX_CAN_N_ISREG_RXF1N_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.RxF1N */
#define IFX_CAN_N_ISREG_RXF1N_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.RxF1N */
#define IFX_CAN_N_ISREG_RXF1N_OFF (3u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.RxF0N */
#define IFX_CAN_N_ISREG_RXF0N_LEN (1u)

