Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_bf.h
/** \brief Mask for Ifx_CAN_N_ISREG_Bits.RxF0N */
#define IFX_CAN_N_ISREG_RXF0N_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.RxF0N */
#define IFX_CAN_N_ISREG_RXF0N_OFF (4u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.RETI */
#define IFX_CAN_N_ISREG_RETI_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.RETI */
#define IFX_CAN_N_ISREG_RETI_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.RETI */
#define IFX_CAN_N_ISREG_RETI_OFF (5u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.TRAQ */
#define IFX_CAN_N_ISREG_TRAQ_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.TRAQ */
#define IFX_CAN_N_ISREG_TRAQ_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.TRAQ */
#define IFX_CAN_N_ISREG_TRAQ_OFF (6u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.TRACO */
#define IFX_CAN_N_ISREG_TRACO_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.TRACO */
#define IFX_CAN_N_ISREG_TRACO_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.TRACO */
#define IFX_CAN_N_ISREG_TRACO_OFF (7u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.TEFIFO */
#define IFX_CAN_N_ISREG_TEFIFO_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.TEFIFO */
#define IFX_CAN_N_ISREG_TEFIFO_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.TEFIFO */
#define IFX_CAN_N_ISREG_TEFIFO_OFF (8u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.HPE */
#define IFX_CAN_N_ISREG_HPE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.HPE */
#define IFX_CAN_N_ISREG_HPE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.HPE */
#define IFX_CAN_N_ISREG_HPE_OFF (9u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.WATI */
#define IFX_CAN_N_ISREG_WATI_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.WATI */
#define IFX_CAN_N_ISREG_WATI_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.WATI */
#define IFX_CAN_N_ISREG_WATI_OFF (10u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.ALRT */
#define IFX_CAN_N_ISREG_ALRT_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.ALRT */
#define IFX_CAN_N_ISREG_ALRT_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.ALRT */
#define IFX_CAN_N_ISREG_ALRT_OFF (11u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.MOER */
#define IFX_CAN_N_ISREG_MOER_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.MOER */
#define IFX_CAN_N_ISREG_MOER_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.MOER */
#define IFX_CAN_N_ISREG_MOER_OFF (12u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.SAFE */
#define IFX_CAN_N_ISREG_SAFE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.SAFE */
#define IFX_CAN_N_ISREG_SAFE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.SAFE */
#define IFX_CAN_N_ISREG_SAFE_OFF (13u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.BOFF */
#define IFX_CAN_N_ISREG_BOFF_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.BOFF */
#define IFX_CAN_N_ISREG_BOFF_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.BOFF */
#define IFX_CAN_N_ISREG_BOFF_OFF (14u)

/** \brief Length for Ifx_CAN_N_ISREG_Bits.LOI */
#define IFX_CAN_N_ISREG_LOI_LEN (1u)

/** \brief Mask for Ifx_CAN_N_ISREG_Bits.LOI */
#define IFX_CAN_N_ISREG_LOI_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_ISREG_Bits.LOI */
#define IFX_CAN_N_ISREG_LOI_OFF (15u)

/** \brief Length for Ifx_CAN_N_NT_CCR_Bits.TPSC */
#define IFX_CAN_N_NT_CCR_TPSC_LEN (4u)

/** \brief Mask for Ifx_CAN_N_NT_CCR_Bits.TPSC */
#define IFX_CAN_N_NT_CCR_TPSC_MSK (0xfu)

/** \brief Offset for Ifx_CAN_N_NT_CCR_Bits.TPSC */
#define IFX_CAN_N_NT_CCR_TPSC_OFF (8u)

/** \brief Length for Ifx_CAN_N_NT_CCR_Bits.STRESET */
#define IFX_CAN_N_NT_CCR_STRESET_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NT_CCR_Bits.STRESET */
#define IFX_CAN_N_NT_CCR_STRESET_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NT_CCR_Bits.STRESET */
#define IFX_CAN_N_NT_CCR_STRESET_OFF (14u)

/** \brief Length for Ifx_CAN_N_NT_CCR_Bits.STSTART */
#define IFX_CAN_N_NT_CCR_STSTART_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NT_CCR_Bits.STSTART */
#define IFX_CAN_N_NT_CCR_STSTART_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NT_CCR_Bits.STSTART */
#define IFX_CAN_N_NT_CCR_STSTART_OFF (15u)

/** \brief Length for Ifx_CAN_N_NT_CCR_Bits.TRIGSRC */
#define IFX_CAN_N_NT_CCR_TRIGSRC_LEN (3u)

/** \brief Mask for Ifx_CAN_N_NT_CCR_Bits.TRIGSRC */
#define IFX_CAN_N_NT_CCR_TRIGSRC_MSK (0x7u)

/** \brief Offset for Ifx_CAN_N_NT_CCR_Bits.TRIGSRC */
#define IFX_CAN_N_NT_CCR_TRIGSRC_OFF (18u)

/** \brief Length for Ifx_CAN_N_NT_ATTR_Bits.RELOAD */
#define IFX_CAN_N_NT_ATTR_RELOAD_LEN (16u)

/** \brief Mask for Ifx_CAN_N_NT_ATTR_Bits.RELOAD */
#define IFX_CAN_N_NT_ATTR_RELOAD_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_NT_ATTR_Bits.RELOAD */
#define IFX_CAN_N_NT_ATTR_RELOAD_OFF (0u)

/** \brief Length for Ifx_CAN_N_NT_ATTR_Bits.TXMO */
#define IFX_CAN_N_NT_ATTR_TXMO_LEN (8u)

/** \brief Mask for Ifx_CAN_N_NT_ATTR_Bits.TXMO */
#define IFX_CAN_N_NT_ATTR_TXMO_MSK (0xffu)

/** \brief Offset for Ifx_CAN_N_NT_ATTR_Bits.TXMO */
#define IFX_CAN_N_NT_ATTR_TXMO_OFF (16u)

/** \brief Length for Ifx_CAN_N_NT_ATTR_Bits.STRT */
#define IFX_CAN_N_NT_ATTR_STRT_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NT_ATTR_Bits.STRT */
#define IFX_CAN_N_NT_ATTR_STRT_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NT_ATTR_Bits.STRT */
#define IFX_CAN_N_NT_ATTR_STRT_OFF (24u)

/** \brief Length for Ifx_CAN_N_NT_BTTR_Bits.RELOAD */
#define IFX_CAN_N_NT_BTTR_RELOAD_LEN (16u)

/** \brief Mask for Ifx_CAN_N_NT_BTTR_Bits.RELOAD */
#define IFX_CAN_N_NT_BTTR_RELOAD_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_NT_BTTR_Bits.RELOAD */
#define IFX_CAN_N_NT_BTTR_RELOAD_OFF (0u)

/** \brief Length for Ifx_CAN_N_NT_BTTR_Bits.TXMO */
#define IFX_CAN_N_NT_BTTR_TXMO_LEN (8u)

/** \brief Mask for Ifx_CAN_N_NT_BTTR_Bits.TXMO */
#define IFX_CAN_N_NT_BTTR_TXMO_MSK (0xffu)

/** \brief Offset for Ifx_CAN_N_NT_BTTR_Bits.TXMO */
#define IFX_CAN_N_NT_BTTR_TXMO_OFF (16u)

/** \brief Length for Ifx_CAN_N_NT_BTTR_Bits.STRT */
#define IFX_CAN_N_NT_BTTR_STRT_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NT_BTTR_Bits.STRT */
#define IFX_CAN_N_NT_BTTR_STRT_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NT_BTTR_Bits.STRT */
#define IFX_CAN_N_NT_BTTR_STRT_OFF (24u)

