Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_bf.h
/** \brief Length for Ifx_CAN_N_NT_CTTR_Bits.RELOAD */
#define IFX_CAN_N_NT_CTTR_RELOAD_LEN (16u)

/** \brief Mask for Ifx_CAN_N_NT_CTTR_Bits.RELOAD */
#define IFX_CAN_N_NT_CTTR_RELOAD_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_NT_CTTR_Bits.RELOAD */
#define IFX_CAN_N_NT_CTTR_RELOAD_OFF (0u)

/** \brief Length for Ifx_CAN_N_NT_CTTR_Bits.TXMO */
#define IFX_CAN_N_NT_CTTR_TXMO_LEN (8u)

/** \brief Mask for Ifx_CAN_N_NT_CTTR_Bits.TXMO */
#define IFX_CAN_N_NT_CTTR_TXMO_MSK (0xffu)

/** \brief Offset for Ifx_CAN_N_NT_CTTR_Bits.TXMO */
#define IFX_CAN_N_NT_CTTR_TXMO_OFF (16u)

/** \brief Length for Ifx_CAN_N_NT_CTTR_Bits.STRT */
#define IFX_CAN_N_NT_CTTR_STRT_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NT_CTTR_Bits.STRT */
#define IFX_CAN_N_NT_CTTR_STRT_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NT_CTTR_Bits.STRT */
#define IFX_CAN_N_NT_CTTR_STRT_OFF (24u)

/** \brief Length for Ifx_CAN_N_NT_RTR_Bits.RELOAD */
#define IFX_CAN_N_NT_RTR_RELOAD_LEN (16u)

/** \brief Mask for Ifx_CAN_N_NT_RTR_Bits.RELOAD */
#define IFX_CAN_N_NT_RTR_RELOAD_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_NT_RTR_Bits.RELOAD */
#define IFX_CAN_N_NT_RTR_RELOAD_OFF (0u)

/** \brief Length for Ifx_CAN_N_NT_RTR_Bits.TEIE */
#define IFX_CAN_N_NT_RTR_TEIE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NT_RTR_Bits.TEIE */
#define IFX_CAN_N_NT_RTR_TEIE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NT_RTR_Bits.TEIE */
#define IFX_CAN_N_NT_RTR_TEIE_OFF (22u)

/** \brief Length for Ifx_CAN_N_NT_RTR_Bits.TE */
#define IFX_CAN_N_NT_RTR_TE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NT_RTR_Bits.TE */
#define IFX_CAN_N_NT_RTR_TE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NT_RTR_Bits.TE */
#define IFX_CAN_N_NT_RTR_TE_OFF (23u)

/** \brief Length for Ifx_CAN_N_NPCR_Bits.RXSEL */
#define IFX_CAN_N_NPCR_RXSEL_LEN (3u)

/** \brief Mask for Ifx_CAN_N_NPCR_Bits.RXSEL */
#define IFX_CAN_N_NPCR_RXSEL_MSK (0x7u)

/** \brief Offset for Ifx_CAN_N_NPCR_Bits.RXSEL */
#define IFX_CAN_N_NPCR_RXSEL_OFF (0u)

/** \brief Length for Ifx_CAN_N_NPCR_Bits.LBM */
#define IFX_CAN_N_NPCR_LBM_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NPCR_Bits.LBM */
#define IFX_CAN_N_NPCR_LBM_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NPCR_Bits.LBM */
#define IFX_CAN_N_NPCR_LBM_OFF (8u)

/** \brief Length for Ifx_CAN_N_NPCR_Bits.LOUT */
#define IFX_CAN_N_NPCR_LOUT_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NPCR_Bits.LOUT */
#define IFX_CAN_N_NPCR_LOUT_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NPCR_Bits.LOUT */
#define IFX_CAN_N_NPCR_LOUT_OFF (9u)

/** \brief Length for Ifx_CAN_N_NPCR_Bits.DELE */
#define IFX_CAN_N_NPCR_DELE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NPCR_Bits.DELE */
#define IFX_CAN_N_NPCR_DELE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NPCR_Bits.DELE */
#define IFX_CAN_N_NPCR_DELE_OFF (10u)

/** \brief Length for Ifx_CAN_N_TTCR_Bits.ETESEL */
#define IFX_CAN_N_TTCR_ETESEL_LEN (2u)

/** \brief Mask for Ifx_CAN_N_TTCR_Bits.ETESEL */
#define IFX_CAN_N_TTCR_ETESEL_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_TTCR_Bits.ETESEL */
#define IFX_CAN_N_TTCR_ETESEL_OFF (2u)

/** \brief Length for Ifx_CAN_N_TTCR_Bits.ETSSEL */
#define IFX_CAN_N_TTCR_ETSSEL_LEN (3u)

/** \brief Mask for Ifx_CAN_N_TTCR_Bits.ETSSEL */
#define IFX_CAN_N_TTCR_ETSSEL_MSK (0x7u)

/** \brief Offset for Ifx_CAN_N_TTCR_Bits.ETSSEL */
#define IFX_CAN_N_TTCR_ETSSEL_OFF (4u)

/** \brief Length for Ifx_CAN_N_TTCR_Bits.TTCTSS */
#define IFX_CAN_N_TTCR_TTCTSS_LEN (3u)

/** \brief Mask for Ifx_CAN_N_TTCR_Bits.TTCTSS */
#define IFX_CAN_N_TTCR_TTCTSS_MSK (0x7u)

/** \brief Offset for Ifx_CAN_N_TTCR_Bits.TTCTSS */
#define IFX_CAN_N_TTCR_TTCTSS_OFF (9u)

/** \brief Length for Ifx_CAN_N_CREL_Bits.SUBSTEP */
#define IFX_CAN_N_CREL_SUBSTEP_LEN (4u)

/** \brief Mask for Ifx_CAN_N_CREL_Bits.SUBSTEP */
#define IFX_CAN_N_CREL_SUBSTEP_MSK (0x0u)

/** \brief Offset for Ifx_CAN_N_CREL_Bits.SUBSTEP */
#define IFX_CAN_N_CREL_SUBSTEP_OFF (20u)

/** \brief Length for Ifx_CAN_N_CREL_Bits.STEP */
#define IFX_CAN_N_CREL_STEP_LEN (4u)

/** \brief Mask for Ifx_CAN_N_CREL_Bits.STEP */
#define IFX_CAN_N_CREL_STEP_MSK (0x0u)

/** \brief Offset for Ifx_CAN_N_CREL_Bits.STEP */
#define IFX_CAN_N_CREL_STEP_OFF (24u)

/** \brief Length for Ifx_CAN_N_CREL_Bits.REL */
#define IFX_CAN_N_CREL_REL_LEN (4u)

/** \brief Mask for Ifx_CAN_N_CREL_Bits.REL */
#define IFX_CAN_N_CREL_REL_MSK (0x0u)

/** \brief Offset for Ifx_CAN_N_CREL_Bits.REL */
#define IFX_CAN_N_CREL_REL_OFF (28u)

/** \brief Length for Ifx_CAN_N_ENDN_Bits.ETV */
#define IFX_CAN_N_ENDN_ETV_LEN (32u)

/** \brief Mask for Ifx_CAN_N_ENDN_Bits.ETV */
#define IFX_CAN_N_ENDN_ETV_MSK (0xffffffffu)

/** \brief Offset for Ifx_CAN_N_ENDN_Bits.ETV */
#define IFX_CAN_N_ENDN_ETV_OFF (0u)

/** \brief Length for Ifx_CAN_N_DBTP_Bits.DSJW */
#define IFX_CAN_N_DBTP_DSJW_LEN (4u)

/** \brief Mask for Ifx_CAN_N_DBTP_Bits.DSJW */
#define IFX_CAN_N_DBTP_DSJW_MSK (0xfu)

/** \brief Offset for Ifx_CAN_N_DBTP_Bits.DSJW */
#define IFX_CAN_N_DBTP_DSJW_OFF (0u)

/** \brief Length for Ifx_CAN_N_DBTP_Bits.DTSEG2 */
#define IFX_CAN_N_DBTP_DTSEG2_LEN (4u)

/** \brief Mask for Ifx_CAN_N_DBTP_Bits.DTSEG2 */
#define IFX_CAN_N_DBTP_DTSEG2_MSK (0xfu)

/** \brief Offset for Ifx_CAN_N_DBTP_Bits.DTSEG2 */
#define IFX_CAN_N_DBTP_DTSEG2_OFF (4u)

/** \brief Length for Ifx_CAN_N_DBTP_Bits.DTSEG1 */
#define IFX_CAN_N_DBTP_DTSEG1_LEN (5u)

/** \brief Mask for Ifx_CAN_N_DBTP_Bits.DTSEG1 */
#define IFX_CAN_N_DBTP_DTSEG1_MSK (0x1fu)

/** \brief Offset for Ifx_CAN_N_DBTP_Bits.DTSEG1 */
#define IFX_CAN_N_DBTP_DTSEG1_OFF (8u)

/** \brief Length for Ifx_CAN_N_DBTP_Bits.DBRP */
#define IFX_CAN_N_DBTP_DBRP_LEN (5u)

/** \brief Mask for Ifx_CAN_N_DBTP_Bits.DBRP */
#define IFX_CAN_N_DBTP_DBRP_MSK (0x1fu)

/** \brief Offset for Ifx_CAN_N_DBTP_Bits.DBRP */
#define IFX_CAN_N_DBTP_DBRP_OFF (16u)

/** \brief Length for Ifx_CAN_N_DBTP_Bits.TDC */
#define IFX_CAN_N_DBTP_TDC_LEN (1u)

/** \brief Mask for Ifx_CAN_N_DBTP_Bits.TDC */
#define IFX_CAN_N_DBTP_TDC_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_DBTP_Bits.TDC */
#define IFX_CAN_N_DBTP_TDC_OFF (23u)

/** \brief Length for Ifx_CAN_N_TEST_Bits.LBCK */
#define IFX_CAN_N_TEST_LBCK_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TEST_Bits.LBCK */
#define IFX_CAN_N_TEST_LBCK_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TEST_Bits.LBCK */
#define IFX_CAN_N_TEST_LBCK_OFF (4u)

/** \brief Length for Ifx_CAN_N_TEST_Bits.TX */
#define IFX_CAN_N_TEST_TX_LEN (2u)

/** \brief Mask for Ifx_CAN_N_TEST_Bits.TX */
#define IFX_CAN_N_TEST_TX_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_TEST_Bits.TX */
#define IFX_CAN_N_TEST_TX_OFF (5u)

/** \brief Length for Ifx_CAN_N_TEST_Bits.RX */
#define IFX_CAN_N_TEST_RX_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TEST_Bits.RX */
#define IFX_CAN_N_TEST_RX_MSK (0x0u)

/** \brief Offset for Ifx_CAN_N_TEST_Bits.RX */
#define IFX_CAN_N_TEST_RX_OFF (7u)

