Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_bf.h
/** \brief Length for Ifx_CAN_N_RWD_Bits.WDC */
#define IFX_CAN_N_RWD_WDC_LEN (8u)

/** \brief Mask for Ifx_CAN_N_RWD_Bits.WDC */
#define IFX_CAN_N_RWD_WDC_MSK (0xffu)

/** \brief Offset for Ifx_CAN_N_RWD_Bits.WDC */
#define IFX_CAN_N_RWD_WDC_OFF (0u)

/** \brief Length for Ifx_CAN_N_RWD_Bits.WDV */
#define IFX_CAN_N_RWD_WDV_LEN (8u)

/** \brief Mask for Ifx_CAN_N_RWD_Bits.WDV */
#define IFX_CAN_N_RWD_WDV_MSK (0xffu)

/** \brief Offset for Ifx_CAN_N_RWD_Bits.WDV */
#define IFX_CAN_N_RWD_WDV_OFF (8u)

/** \brief Length for Ifx_CAN_N_CCCR_Bits.INIT */
#define IFX_CAN_N_CCCR_INIT_LEN (1u)

/** \brief Mask for Ifx_CAN_N_CCCR_Bits.INIT */
#define IFX_CAN_N_CCCR_INIT_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_CCCR_Bits.INIT */
#define IFX_CAN_N_CCCR_INIT_OFF (0u)

/** \brief Length for Ifx_CAN_N_CCCR_Bits.CCE */
#define IFX_CAN_N_CCCR_CCE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_CCCR_Bits.CCE */
#define IFX_CAN_N_CCCR_CCE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_CCCR_Bits.CCE */
#define IFX_CAN_N_CCCR_CCE_OFF (1u)

/** \brief Length for Ifx_CAN_N_CCCR_Bits.ASM */
#define IFX_CAN_N_CCCR_ASM_LEN (1u)

/** \brief Mask for Ifx_CAN_N_CCCR_Bits.ASM */
#define IFX_CAN_N_CCCR_ASM_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_CCCR_Bits.ASM */
#define IFX_CAN_N_CCCR_ASM_OFF (2u)

/** \brief Length for Ifx_CAN_N_CCCR_Bits.CSA */
#define IFX_CAN_N_CCCR_CSA_LEN (1u)

/** \brief Mask for Ifx_CAN_N_CCCR_Bits.CSA */
#define IFX_CAN_N_CCCR_CSA_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_CCCR_Bits.CSA */
#define IFX_CAN_N_CCCR_CSA_OFF (3u)

/** \brief Length for Ifx_CAN_N_CCCR_Bits.CSR */
#define IFX_CAN_N_CCCR_CSR_LEN (1u)

/** \brief Mask for Ifx_CAN_N_CCCR_Bits.CSR */
#define IFX_CAN_N_CCCR_CSR_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_CCCR_Bits.CSR */
#define IFX_CAN_N_CCCR_CSR_OFF (4u)

/** \brief Length for Ifx_CAN_N_CCCR_Bits.MON */
#define IFX_CAN_N_CCCR_MON_LEN (1u)

/** \brief Mask for Ifx_CAN_N_CCCR_Bits.MON */
#define IFX_CAN_N_CCCR_MON_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_CCCR_Bits.MON */
#define IFX_CAN_N_CCCR_MON_OFF (5u)

/** \brief Length for Ifx_CAN_N_CCCR_Bits.DAR */
#define IFX_CAN_N_CCCR_DAR_LEN (1u)

/** \brief Mask for Ifx_CAN_N_CCCR_Bits.DAR */
#define IFX_CAN_N_CCCR_DAR_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_CCCR_Bits.DAR */
#define IFX_CAN_N_CCCR_DAR_OFF (6u)

/** \brief Length for Ifx_CAN_N_CCCR_Bits.TEST */
#define IFX_CAN_N_CCCR_TEST_LEN (1u)

/** \brief Mask for Ifx_CAN_N_CCCR_Bits.TEST */
#define IFX_CAN_N_CCCR_TEST_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_CCCR_Bits.TEST */
#define IFX_CAN_N_CCCR_TEST_OFF (7u)

/** \brief Length for Ifx_CAN_N_CCCR_Bits.FDOE */
#define IFX_CAN_N_CCCR_FDOE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_CCCR_Bits.FDOE */
#define IFX_CAN_N_CCCR_FDOE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_CCCR_Bits.FDOE */
#define IFX_CAN_N_CCCR_FDOE_OFF (8u)

/** \brief Length for Ifx_CAN_N_CCCR_Bits.BRSE */
#define IFX_CAN_N_CCCR_BRSE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_CCCR_Bits.BRSE */
#define IFX_CAN_N_CCCR_BRSE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_CCCR_Bits.BRSE */
#define IFX_CAN_N_CCCR_BRSE_OFF (9u)

/** \brief Length for Ifx_CAN_N_CCCR_Bits.PXHD */
#define IFX_CAN_N_CCCR_PXHD_LEN (1u)

/** \brief Mask for Ifx_CAN_N_CCCR_Bits.PXHD */
#define IFX_CAN_N_CCCR_PXHD_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_CCCR_Bits.PXHD */
#define IFX_CAN_N_CCCR_PXHD_OFF (12u)

/** \brief Length for Ifx_CAN_N_CCCR_Bits.EFBI */
#define IFX_CAN_N_CCCR_EFBI_LEN (1u)

/** \brief Mask for Ifx_CAN_N_CCCR_Bits.EFBI */
#define IFX_CAN_N_CCCR_EFBI_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_CCCR_Bits.EFBI */
#define IFX_CAN_N_CCCR_EFBI_OFF (13u)

/** \brief Length for Ifx_CAN_N_CCCR_Bits.TXP */
#define IFX_CAN_N_CCCR_TXP_LEN (1u)

/** \brief Mask for Ifx_CAN_N_CCCR_Bits.TXP */
#define IFX_CAN_N_CCCR_TXP_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_CCCR_Bits.TXP */
#define IFX_CAN_N_CCCR_TXP_OFF (14u)

/** \brief Length for Ifx_CAN_N_CCCR_Bits.NISO */
#define IFX_CAN_N_CCCR_NISO_LEN (1u)

/** \brief Mask for Ifx_CAN_N_CCCR_Bits.NISO */
#define IFX_CAN_N_CCCR_NISO_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_CCCR_Bits.NISO */
#define IFX_CAN_N_CCCR_NISO_OFF (15u)

/** \brief Length for Ifx_CAN_N_NBTP_Bits.NTSEG2 */
#define IFX_CAN_N_NBTP_NTSEG2_LEN (7u)

/** \brief Mask for Ifx_CAN_N_NBTP_Bits.NTSEG2 */
#define IFX_CAN_N_NBTP_NTSEG2_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_NBTP_Bits.NTSEG2 */
#define IFX_CAN_N_NBTP_NTSEG2_OFF (0u)

/** \brief Length for Ifx_CAN_N_NBTP_Bits.NTSEG1 */
#define IFX_CAN_N_NBTP_NTSEG1_LEN (8u)

/** \brief Mask for Ifx_CAN_N_NBTP_Bits.NTSEG1 */
#define IFX_CAN_N_NBTP_NTSEG1_MSK (0xffu)

/** \brief Offset for Ifx_CAN_N_NBTP_Bits.NTSEG1 */
#define IFX_CAN_N_NBTP_NTSEG1_OFF (8u)

/** \brief Length for Ifx_CAN_N_NBTP_Bits.NBRP */
#define IFX_CAN_N_NBTP_NBRP_LEN (9u)

/** \brief Mask for Ifx_CAN_N_NBTP_Bits.NBRP */
#define IFX_CAN_N_NBTP_NBRP_MSK (0x1ffu)

/** \brief Offset for Ifx_CAN_N_NBTP_Bits.NBRP */
#define IFX_CAN_N_NBTP_NBRP_OFF (16u)

/** \brief Length for Ifx_CAN_N_NBTP_Bits.NSJW */
#define IFX_CAN_N_NBTP_NSJW_LEN (7u)

/** \brief Mask for Ifx_CAN_N_NBTP_Bits.NSJW */
#define IFX_CAN_N_NBTP_NSJW_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_NBTP_Bits.NSJW */
#define IFX_CAN_N_NBTP_NSJW_OFF (25u)

/** \brief Length for Ifx_CAN_N_TSCC_Bits.TSS */
#define IFX_CAN_N_TSCC_TSS_LEN (2u)

/** \brief Mask for Ifx_CAN_N_TSCC_Bits.TSS */
#define IFX_CAN_N_TSCC_TSS_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_TSCC_Bits.TSS */
#define IFX_CAN_N_TSCC_TSS_OFF (0u)

/** \brief Length for Ifx_CAN_N_TSCC_Bits.TCP */
#define IFX_CAN_N_TSCC_TCP_LEN (4u)

/** \brief Mask for Ifx_CAN_N_TSCC_Bits.TCP */
#define IFX_CAN_N_TSCC_TCP_MSK (0xfu)

/** \brief Offset for Ifx_CAN_N_TSCC_Bits.TCP */
#define IFX_CAN_N_TSCC_TCP_OFF (16u)

/** \brief Length for Ifx_CAN_N_TSCV_Bits.TSC */
#define IFX_CAN_N_TSCV_TSC_LEN (16u)

/** \brief Mask for Ifx_CAN_N_TSCV_Bits.TSC */
#define IFX_CAN_N_TSCV_TSC_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_TSCV_Bits.TSC */
#define IFX_CAN_N_TSCV_TSC_OFF (0u)

/** \brief Length for Ifx_CAN_N_TOCC_Bits.ETOC */
#define IFX_CAN_N_TOCC_ETOC_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TOCC_Bits.ETOC */
#define IFX_CAN_N_TOCC_ETOC_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TOCC_Bits.ETOC */
#define IFX_CAN_N_TOCC_ETOC_OFF (0u)

/** \brief Length for Ifx_CAN_N_TOCC_Bits.TOS */
#define IFX_CAN_N_TOCC_TOS_LEN (2u)

/** \brief Mask for Ifx_CAN_N_TOCC_Bits.TOS */
#define IFX_CAN_N_TOCC_TOS_MSK (0x3u)

