Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_bf.h
/** \brief Offset for Ifx_CAN_N_TX_EFS_Bits.EFPI */
#define IFX_CAN_N_TX_EFS_EFPI_OFF (16u)

/** \brief Length for Ifx_CAN_N_TX_EFS_Bits.EFF */
#define IFX_CAN_N_TX_EFS_EFF_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_EFS_Bits.EFF */
#define IFX_CAN_N_TX_EFS_EFF_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_EFS_Bits.EFF */
#define IFX_CAN_N_TX_EFS_EFF_OFF (24u)

/** \brief Length for Ifx_CAN_N_TX_EFS_Bits.TEFL */
#define IFX_CAN_N_TX_EFS_TEFL_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_EFS_Bits.TEFL */
#define IFX_CAN_N_TX_EFS_TEFL_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_EFS_Bits.TEFL */
#define IFX_CAN_N_TX_EFS_TEFL_OFF (25u)

/** \brief Length for Ifx_CAN_N_TX_EFA_Bits.EFAI */
#define IFX_CAN_N_TX_EFA_EFAI_LEN (5u)

/** \brief Mask for Ifx_CAN_N_TX_EFA_Bits.EFAI */
#define IFX_CAN_N_TX_EFA_EFAI_MSK (0x1fu)

/** \brief Offset for Ifx_CAN_N_TX_EFA_Bits.EFAI */
#define IFX_CAN_N_TX_EFA_EFAI_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_TMC_Bits.TMSA */
#define IFX_CAN_N_TT_TMC_TMSA_LEN (14u)

/** \brief Mask for Ifx_CAN_N_TT_TMC_Bits.TMSA */
#define IFX_CAN_N_TT_TMC_TMSA_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_N_TT_TMC_Bits.TMSA */
#define IFX_CAN_N_TT_TMC_TMSA_OFF (2u)

/** \brief Length for Ifx_CAN_N_TT_TMC_Bits.TME */
#define IFX_CAN_N_TT_TMC_TME_LEN (7u)

/** \brief Mask for Ifx_CAN_N_TT_TMC_Bits.TME */
#define IFX_CAN_N_TT_TMC_TME_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_TT_TMC_Bits.TME */
#define IFX_CAN_N_TT_TMC_TME_OFF (16u)

/** \brief Length for Ifx_CAN_N_TT_RMC_Bits.RID */
#define IFX_CAN_N_TT_RMC_RID_LEN (29u)

/** \brief Mask for Ifx_CAN_N_TT_RMC_Bits.RID */
#define IFX_CAN_N_TT_RMC_RID_MSK (0x1fffffffu)

/** \brief Offset for Ifx_CAN_N_TT_RMC_Bits.RID */
#define IFX_CAN_N_TT_RMC_RID_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_RMC_Bits.XTD */
#define IFX_CAN_N_TT_RMC_XTD_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_RMC_Bits.XTD */
#define IFX_CAN_N_TT_RMC_XTD_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_RMC_Bits.XTD */
#define IFX_CAN_N_TT_RMC_XTD_OFF (30u)

/** \brief Length for Ifx_CAN_N_TT_RMC_Bits.RMPS */
#define IFX_CAN_N_TT_RMC_RMPS_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_RMC_Bits.RMPS */
#define IFX_CAN_N_TT_RMC_RMPS_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_RMC_Bits.RMPS */
#define IFX_CAN_N_TT_RMC_RMPS_OFF (31u)

/** \brief Length for Ifx_CAN_N_TT_OCF_Bits.OM */
#define IFX_CAN_N_TT_OCF_OM_LEN (2u)

/** \brief Mask for Ifx_CAN_N_TT_OCF_Bits.OM */
#define IFX_CAN_N_TT_OCF_OM_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_TT_OCF_Bits.OM */
#define IFX_CAN_N_TT_OCF_OM_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_OCF_Bits.GEN */
#define IFX_CAN_N_TT_OCF_GEN_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCF_Bits.GEN */
#define IFX_CAN_N_TT_OCF_GEN_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCF_Bits.GEN */
#define IFX_CAN_N_TT_OCF_GEN_OFF (3u)

/** \brief Length for Ifx_CAN_N_TT_OCF_Bits.TM */
#define IFX_CAN_N_TT_OCF_TM_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCF_Bits.TM */
#define IFX_CAN_N_TT_OCF_TM_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCF_Bits.TM */
#define IFX_CAN_N_TT_OCF_TM_OFF (4u)

/** \brief Length for Ifx_CAN_N_TT_OCF_Bits.LDSDL */
#define IFX_CAN_N_TT_OCF_LDSDL_LEN (3u)

/** \brief Mask for Ifx_CAN_N_TT_OCF_Bits.LDSDL */
#define IFX_CAN_N_TT_OCF_LDSDL_MSK (0x7u)

/** \brief Offset for Ifx_CAN_N_TT_OCF_Bits.LDSDL */
#define IFX_CAN_N_TT_OCF_LDSDL_OFF (5u)

/** \brief Length for Ifx_CAN_N_TT_OCF_Bits.IRTO */
#define IFX_CAN_N_TT_OCF_IRTO_LEN (7u)

/** \brief Mask for Ifx_CAN_N_TT_OCF_Bits.IRTO */
#define IFX_CAN_N_TT_OCF_IRTO_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_TT_OCF_Bits.IRTO */
#define IFX_CAN_N_TT_OCF_IRTO_OFF (8u)

/** \brief Length for Ifx_CAN_N_TT_OCF_Bits.EECS */
#define IFX_CAN_N_TT_OCF_EECS_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCF_Bits.EECS */
#define IFX_CAN_N_TT_OCF_EECS_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCF_Bits.EECS */
#define IFX_CAN_N_TT_OCF_EECS_OFF (15u)

/** \brief Length for Ifx_CAN_N_TT_OCF_Bits.AWL */
#define IFX_CAN_N_TT_OCF_AWL_LEN (8u)

/** \brief Mask for Ifx_CAN_N_TT_OCF_Bits.AWL */
#define IFX_CAN_N_TT_OCF_AWL_MSK (0xffu)

/** \brief Offset for Ifx_CAN_N_TT_OCF_Bits.AWL */
#define IFX_CAN_N_TT_OCF_AWL_OFF (16u)

/** \brief Length for Ifx_CAN_N_TT_OCF_Bits.EGTF */
#define IFX_CAN_N_TT_OCF_EGTF_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCF_Bits.EGTF */
#define IFX_CAN_N_TT_OCF_EGTF_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCF_Bits.EGTF */
#define IFX_CAN_N_TT_OCF_EGTF_OFF (24u)

/** \brief Length for Ifx_CAN_N_TT_OCF_Bits.ECC */
#define IFX_CAN_N_TT_OCF_ECC_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCF_Bits.ECC */
#define IFX_CAN_N_TT_OCF_ECC_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCF_Bits.ECC */
#define IFX_CAN_N_TT_OCF_ECC_OFF (25u)

/** \brief Length for Ifx_CAN_N_TT_OCF_Bits.EVTP */
#define IFX_CAN_N_TT_OCF_EVTP_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCF_Bits.EVTP */
#define IFX_CAN_N_TT_OCF_EVTP_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCF_Bits.EVTP */
#define IFX_CAN_N_TT_OCF_EVTP_OFF (26u)

/** \brief Length for Ifx_CAN_N_TT_MLM_Bits.CCM */
#define IFX_CAN_N_TT_MLM_CCM_LEN (6u)

/** \brief Mask for Ifx_CAN_N_TT_MLM_Bits.CCM */
#define IFX_CAN_N_TT_MLM_CCM_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_TT_MLM_Bits.CCM */
#define IFX_CAN_N_TT_MLM_CCM_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_MLM_Bits.CSS */
#define IFX_CAN_N_TT_MLM_CSS_LEN (2u)

/** \brief Mask for Ifx_CAN_N_TT_MLM_Bits.CSS */
#define IFX_CAN_N_TT_MLM_CSS_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_TT_MLM_Bits.CSS */
#define IFX_CAN_N_TT_MLM_CSS_OFF (6u)

/** \brief Length for Ifx_CAN_N_TT_MLM_Bits.TXEW */
#define IFX_CAN_N_TT_MLM_TXEW_LEN (4u)

/** \brief Mask for Ifx_CAN_N_TT_MLM_Bits.TXEW */
#define IFX_CAN_N_TT_MLM_TXEW_MSK (0xfu)

/** \brief Offset for Ifx_CAN_N_TT_MLM_Bits.TXEW */
#define IFX_CAN_N_TT_MLM_TXEW_OFF (8u)

/** \brief Length for Ifx_CAN_N_TT_MLM_Bits.ENTT */
#define IFX_CAN_N_TT_MLM_ENTT_LEN (12u)

/** \brief Mask for Ifx_CAN_N_TT_MLM_Bits.ENTT */
#define IFX_CAN_N_TT_MLM_ENTT_MSK (0xfffu)

