Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_bf.h
/** \brief Offset for Ifx_CAN_N_TT_MLM_Bits.ENTT */
#define IFX_CAN_N_TT_MLM_ENTT_OFF (16u)

/** \brief Length for Ifx_CAN_N_TT_TURCF_Bits.NCL */
#define IFX_CAN_N_TT_TURCF_NCL_LEN (16u)

/** \brief Mask for Ifx_CAN_N_TT_TURCF_Bits.NCL */
#define IFX_CAN_N_TT_TURCF_NCL_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_TT_TURCF_Bits.NCL */
#define IFX_CAN_N_TT_TURCF_NCL_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_TURCF_Bits.DC */
#define IFX_CAN_N_TT_TURCF_DC_LEN (14u)

/** \brief Mask for Ifx_CAN_N_TT_TURCF_Bits.DC */
#define IFX_CAN_N_TT_TURCF_DC_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_N_TT_TURCF_Bits.DC */
#define IFX_CAN_N_TT_TURCF_DC_OFF (16u)

/** \brief Length for Ifx_CAN_N_TT_TURCF_Bits.ELT */
#define IFX_CAN_N_TT_TURCF_ELT_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_TURCF_Bits.ELT */
#define IFX_CAN_N_TT_TURCF_ELT_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_TURCF_Bits.ELT */
#define IFX_CAN_N_TT_TURCF_ELT_OFF (31u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.SGT */
#define IFX_CAN_N_TT_OCN_SGT_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.SGT */
#define IFX_CAN_N_TT_OCN_SGT_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.SGT */
#define IFX_CAN_N_TT_OCN_SGT_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.ECS */
#define IFX_CAN_N_TT_OCN_ECS_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.ECS */
#define IFX_CAN_N_TT_OCN_ECS_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.ECS */
#define IFX_CAN_N_TT_OCN_ECS_OFF (1u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.SWP */
#define IFX_CAN_N_TT_OCN_SWP_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.SWP */
#define IFX_CAN_N_TT_OCN_SWP_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.SWP */
#define IFX_CAN_N_TT_OCN_SWP_OFF (2u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.SWS */
#define IFX_CAN_N_TT_OCN_SWS_LEN (2u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.SWS */
#define IFX_CAN_N_TT_OCN_SWS_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.SWS */
#define IFX_CAN_N_TT_OCN_SWS_OFF (3u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.RTIE */
#define IFX_CAN_N_TT_OCN_RTIE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.RTIE */
#define IFX_CAN_N_TT_OCN_RTIE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.RTIE */
#define IFX_CAN_N_TT_OCN_RTIE_OFF (5u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.TMC */
#define IFX_CAN_N_TT_OCN_TMC_LEN (2u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.TMC */
#define IFX_CAN_N_TT_OCN_TMC_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.TMC */
#define IFX_CAN_N_TT_OCN_TMC_OFF (6u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.TTIE */
#define IFX_CAN_N_TT_OCN_TTIE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.TTIE */
#define IFX_CAN_N_TT_OCN_TTIE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.TTIE */
#define IFX_CAN_N_TT_OCN_TTIE_OFF (8u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.GCS */
#define IFX_CAN_N_TT_OCN_GCS_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.GCS */
#define IFX_CAN_N_TT_OCN_GCS_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.GCS */
#define IFX_CAN_N_TT_OCN_GCS_OFF (9u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.FGP */
#define IFX_CAN_N_TT_OCN_FGP_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.FGP */
#define IFX_CAN_N_TT_OCN_FGP_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.FGP */
#define IFX_CAN_N_TT_OCN_FGP_OFF (10u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.TMG */
#define IFX_CAN_N_TT_OCN_TMG_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.TMG */
#define IFX_CAN_N_TT_OCN_TMG_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.TMG */
#define IFX_CAN_N_TT_OCN_TMG_OFF (11u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.NIG */
#define IFX_CAN_N_TT_OCN_NIG_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.NIG */
#define IFX_CAN_N_TT_OCN_NIG_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.NIG */
#define IFX_CAN_N_TT_OCN_NIG_OFF (12u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.ESCN */
#define IFX_CAN_N_TT_OCN_ESCN_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.ESCN */
#define IFX_CAN_N_TT_OCN_ESCN_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.ESCN */
#define IFX_CAN_N_TT_OCN_ESCN_OFF (13u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.LCKC */
#define IFX_CAN_N_TT_OCN_LCKC_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.LCKC */
#define IFX_CAN_N_TT_OCN_LCKC_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.LCKC */
#define IFX_CAN_N_TT_OCN_LCKC_OFF (15u)

/** \brief Length for Ifx_CAN_N_TT_GTP_Bits.TP */
#define IFX_CAN_N_TT_GTP_TP_LEN (16u)

/** \brief Mask for Ifx_CAN_N_TT_GTP_Bits.TP */
#define IFX_CAN_N_TT_GTP_TP_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_TT_GTP_Bits.TP */
#define IFX_CAN_N_TT_GTP_TP_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_GTP_Bits.CTP */
#define IFX_CAN_N_TT_GTP_CTP_LEN (16u)

/** \brief Mask for Ifx_CAN_N_TT_GTP_Bits.CTP */
#define IFX_CAN_N_TT_GTP_CTP_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_TT_GTP_Bits.CTP */
#define IFX_CAN_N_TT_GTP_CTP_OFF (16u)

/** \brief Length for Ifx_CAN_N_TT_TMK_Bits.TM */
#define IFX_CAN_N_TT_TMK_TM_LEN (16u)

/** \brief Mask for Ifx_CAN_N_TT_TMK_Bits.TM */
#define IFX_CAN_N_TT_TMK_TM_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_TT_TMK_Bits.TM */
#define IFX_CAN_N_TT_TMK_TM_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_TMK_Bits.TICC */
#define IFX_CAN_N_TT_TMK_TICC_LEN (7u)

/** \brief Mask for Ifx_CAN_N_TT_TMK_Bits.TICC */
#define IFX_CAN_N_TT_TMK_TICC_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_TT_TMK_Bits.TICC */
#define IFX_CAN_N_TT_TMK_TICC_OFF (16u)

/** \brief Length for Ifx_CAN_N_TT_TMK_Bits.LCKM */
#define IFX_CAN_N_TT_TMK_LCKM_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_TMK_Bits.LCKM */
#define IFX_CAN_N_TT_TMK_LCKM_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_TMK_Bits.LCKM */
#define IFX_CAN_N_TT_TMK_LCKM_OFF (31u)

/** \brief Length for Ifx_CAN_N_TT_IR_Bits.SBC */
#define IFX_CAN_N_TT_IR_SBC_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IR_Bits.SBC */
#define IFX_CAN_N_TT_IR_SBC_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IR_Bits.SBC */
#define IFX_CAN_N_TT_IR_SBC_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_IR_Bits.SMC */
#define IFX_CAN_N_TT_IR_SMC_LEN (1u)

