Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_bf.h
/** \brief Mask for Ifx_CAN_N_TT_IR_Bits.SMC */
#define IFX_CAN_N_TT_IR_SMC_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IR_Bits.SMC */
#define IFX_CAN_N_TT_IR_SMC_OFF (1u)

/** \brief Length for Ifx_CAN_N_TT_IR_Bits.CSM */
#define IFX_CAN_N_TT_IR_CSM_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IR_Bits.CSM */
#define IFX_CAN_N_TT_IR_CSM_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IR_Bits.CSM */
#define IFX_CAN_N_TT_IR_CSM_OFF (2u)

/** \brief Length for Ifx_CAN_N_TT_IR_Bits.SOG */
#define IFX_CAN_N_TT_IR_SOG_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IR_Bits.SOG */
#define IFX_CAN_N_TT_IR_SOG_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IR_Bits.SOG */
#define IFX_CAN_N_TT_IR_SOG_OFF (3u)

/** \brief Length for Ifx_CAN_N_TT_IR_Bits.RTMI */
#define IFX_CAN_N_TT_IR_RTMI_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IR_Bits.RTMI */
#define IFX_CAN_N_TT_IR_RTMI_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IR_Bits.RTMI */
#define IFX_CAN_N_TT_IR_RTMI_OFF (4u)

/** \brief Length for Ifx_CAN_N_TT_IR_Bits.TTMI */
#define IFX_CAN_N_TT_IR_TTMI_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IR_Bits.TTMI */
#define IFX_CAN_N_TT_IR_TTMI_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IR_Bits.TTMI */
#define IFX_CAN_N_TT_IR_TTMI_OFF (5u)

/** \brief Length for Ifx_CAN_N_TT_IR_Bits.SWE */
#define IFX_CAN_N_TT_IR_SWE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IR_Bits.SWE */
#define IFX_CAN_N_TT_IR_SWE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IR_Bits.SWE */
#define IFX_CAN_N_TT_IR_SWE_OFF (6u)

/** \brief Length for Ifx_CAN_N_TT_IR_Bits.GTW */
#define IFX_CAN_N_TT_IR_GTW_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IR_Bits.GTW */
#define IFX_CAN_N_TT_IR_GTW_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IR_Bits.GTW */
#define IFX_CAN_N_TT_IR_GTW_OFF (7u)

/** \brief Length for Ifx_CAN_N_TT_IR_Bits.GTD */
#define IFX_CAN_N_TT_IR_GTD_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IR_Bits.GTD */
#define IFX_CAN_N_TT_IR_GTD_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IR_Bits.GTD */
#define IFX_CAN_N_TT_IR_GTD_OFF (8u)

/** \brief Length for Ifx_CAN_N_TT_IR_Bits.GTE */
#define IFX_CAN_N_TT_IR_GTE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IR_Bits.GTE */
#define IFX_CAN_N_TT_IR_GTE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IR_Bits.GTE */
#define IFX_CAN_N_TT_IR_GTE_OFF (9u)

/** \brief Length for Ifx_CAN_N_TT_IR_Bits.TXU */
#define IFX_CAN_N_TT_IR_TXU_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IR_Bits.TXU */
#define IFX_CAN_N_TT_IR_TXU_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IR_Bits.TXU */
#define IFX_CAN_N_TT_IR_TXU_OFF (10u)

/** \brief Length for Ifx_CAN_N_TT_IR_Bits.TXO */
#define IFX_CAN_N_TT_IR_TXO_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IR_Bits.TXO */
#define IFX_CAN_N_TT_IR_TXO_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IR_Bits.TXO */
#define IFX_CAN_N_TT_IR_TXO_OFF (11u)

/** \brief Length for Ifx_CAN_N_TT_IR_Bits.SE1 */
#define IFX_CAN_N_TT_IR_SE1_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IR_Bits.SE1 */
#define IFX_CAN_N_TT_IR_SE1_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IR_Bits.SE1 */
#define IFX_CAN_N_TT_IR_SE1_OFF (12u)

/** \brief Length for Ifx_CAN_N_TT_IR_Bits.SE2 */
#define IFX_CAN_N_TT_IR_SE2_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IR_Bits.SE2 */
#define IFX_CAN_N_TT_IR_SE2_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IR_Bits.SE2 */
#define IFX_CAN_N_TT_IR_SE2_OFF (13u)

/** \brief Length for Ifx_CAN_N_TT_IR_Bits.ELC */
#define IFX_CAN_N_TT_IR_ELC_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IR_Bits.ELC */
#define IFX_CAN_N_TT_IR_ELC_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IR_Bits.ELC */
#define IFX_CAN_N_TT_IR_ELC_OFF (14u)

/** \brief Length for Ifx_CAN_N_TT_IR_Bits.IWT */
#define IFX_CAN_N_TT_IR_IWT_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IR_Bits.IWT */
#define IFX_CAN_N_TT_IR_IWT_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IR_Bits.IWT */
#define IFX_CAN_N_TT_IR_IWT_OFF (15u)

/** \brief Length for Ifx_CAN_N_TT_IR_Bits.WT */
#define IFX_CAN_N_TT_IR_WT_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IR_Bits.WT */
#define IFX_CAN_N_TT_IR_WT_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IR_Bits.WT */
#define IFX_CAN_N_TT_IR_WT_OFF (16u)

/** \brief Length for Ifx_CAN_N_TT_IR_Bits.AW */
#define IFX_CAN_N_TT_IR_AW_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IR_Bits.AW */
#define IFX_CAN_N_TT_IR_AW_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IR_Bits.AW */
#define IFX_CAN_N_TT_IR_AW_OFF (17u)

/** \brief Length for Ifx_CAN_N_TT_IR_Bits.CER */
#define IFX_CAN_N_TT_IR_CER_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IR_Bits.CER */
#define IFX_CAN_N_TT_IR_CER_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IR_Bits.CER */
#define IFX_CAN_N_TT_IR_CER_OFF (18u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.SBCE */
#define IFX_CAN_N_TT_IE_SBCE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.SBCE */
#define IFX_CAN_N_TT_IE_SBCE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.SBCE */
#define IFX_CAN_N_TT_IE_SBCE_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.SMCE */
#define IFX_CAN_N_TT_IE_SMCE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.SMCE */
#define IFX_CAN_N_TT_IE_SMCE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.SMCE */
#define IFX_CAN_N_TT_IE_SMCE_OFF (1u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.CSME */
#define IFX_CAN_N_TT_IE_CSME_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.CSME */
#define IFX_CAN_N_TT_IE_CSME_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.CSME */
#define IFX_CAN_N_TT_IE_CSME_OFF (2u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.SOGE */
#define IFX_CAN_N_TT_IE_SOGE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.SOGE */
#define IFX_CAN_N_TT_IE_SOGE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.SOGE */
#define IFX_CAN_N_TT_IE_SOGE_OFF (3u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.RTMIE */
#define IFX_CAN_N_TT_IE_RTMIE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.RTMIE */
#define IFX_CAN_N_TT_IE_RTMIE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.RTMIE */
#define IFX_CAN_N_TT_IE_RTMIE_OFF (4u)

