Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_bf.h
/** \brief Length for Ifx_CAN_N_TT_IE_Bits.TTMIE */
#define IFX_CAN_N_TT_IE_TTMIE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.TTMIE */
#define IFX_CAN_N_TT_IE_TTMIE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.TTMIE */
#define IFX_CAN_N_TT_IE_TTMIE_OFF (5u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.SWEE */
#define IFX_CAN_N_TT_IE_SWEE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.SWEE */
#define IFX_CAN_N_TT_IE_SWEE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.SWEE */
#define IFX_CAN_N_TT_IE_SWEE_OFF (6u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.GTWE */
#define IFX_CAN_N_TT_IE_GTWE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.GTWE */
#define IFX_CAN_N_TT_IE_GTWE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.GTWE */
#define IFX_CAN_N_TT_IE_GTWE_OFF (7u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.GTDE */
#define IFX_CAN_N_TT_IE_GTDE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.GTDE */
#define IFX_CAN_N_TT_IE_GTDE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.GTDE */
#define IFX_CAN_N_TT_IE_GTDE_OFF (8u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.GTEE */
#define IFX_CAN_N_TT_IE_GTEE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.GTEE */
#define IFX_CAN_N_TT_IE_GTEE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.GTEE */
#define IFX_CAN_N_TT_IE_GTEE_OFF (9u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.TXUE */
#define IFX_CAN_N_TT_IE_TXUE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.TXUE */
#define IFX_CAN_N_TT_IE_TXUE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.TXUE */
#define IFX_CAN_N_TT_IE_TXUE_OFF (10u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.TXOE */
#define IFX_CAN_N_TT_IE_TXOE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.TXOE */
#define IFX_CAN_N_TT_IE_TXOE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.TXOE */
#define IFX_CAN_N_TT_IE_TXOE_OFF (11u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.SE1E */
#define IFX_CAN_N_TT_IE_SE1E_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.SE1E */
#define IFX_CAN_N_TT_IE_SE1E_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.SE1E */
#define IFX_CAN_N_TT_IE_SE1E_OFF (12u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.SE2E */
#define IFX_CAN_N_TT_IE_SE2E_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.SE2E */
#define IFX_CAN_N_TT_IE_SE2E_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.SE2E */
#define IFX_CAN_N_TT_IE_SE2E_OFF (13u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.ELCE */
#define IFX_CAN_N_TT_IE_ELCE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.ELCE */
#define IFX_CAN_N_TT_IE_ELCE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.ELCE */
#define IFX_CAN_N_TT_IE_ELCE_OFF (14u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.IWTE */
#define IFX_CAN_N_TT_IE_IWTE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.IWTE */
#define IFX_CAN_N_TT_IE_IWTE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.IWTE */
#define IFX_CAN_N_TT_IE_IWTE_OFF (15u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.WTE */
#define IFX_CAN_N_TT_IE_WTE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.WTE */
#define IFX_CAN_N_TT_IE_WTE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.WTE */
#define IFX_CAN_N_TT_IE_WTE_OFF (16u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.AWE */
#define IFX_CAN_N_TT_IE_AWE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.AWE */
#define IFX_CAN_N_TT_IE_AWE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.AWE */
#define IFX_CAN_N_TT_IE_AWE_OFF (17u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.CERE */
#define IFX_CAN_N_TT_IE_CERE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.CERE */
#define IFX_CAN_N_TT_IE_CERE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.CERE */
#define IFX_CAN_N_TT_IE_CERE_OFF (18u)

/** \brief Length for Ifx_CAN_N_TT_ILS_Bits.SBCL */
#define IFX_CAN_N_TT_ILS_SBCL_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_ILS_Bits.SBCL */
#define IFX_CAN_N_TT_ILS_SBCL_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_ILS_Bits.SBCL */
#define IFX_CAN_N_TT_ILS_SBCL_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_ILS_Bits.SMCL */
#define IFX_CAN_N_TT_ILS_SMCL_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_ILS_Bits.SMCL */
#define IFX_CAN_N_TT_ILS_SMCL_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_ILS_Bits.SMCL */
#define IFX_CAN_N_TT_ILS_SMCL_OFF (1u)

/** \brief Length for Ifx_CAN_N_TT_ILS_Bits.CSML */
#define IFX_CAN_N_TT_ILS_CSML_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_ILS_Bits.CSML */
#define IFX_CAN_N_TT_ILS_CSML_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_ILS_Bits.CSML */
#define IFX_CAN_N_TT_ILS_CSML_OFF (2u)

/** \brief Length for Ifx_CAN_N_TT_ILS_Bits.SOGL */
#define IFX_CAN_N_TT_ILS_SOGL_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_ILS_Bits.SOGL */
#define IFX_CAN_N_TT_ILS_SOGL_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_ILS_Bits.SOGL */
#define IFX_CAN_N_TT_ILS_SOGL_OFF (3u)

/** \brief Length for Ifx_CAN_N_TT_ILS_Bits.RTMIL */
#define IFX_CAN_N_TT_ILS_RTMIL_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_ILS_Bits.RTMIL */
#define IFX_CAN_N_TT_ILS_RTMIL_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_ILS_Bits.RTMIL */
#define IFX_CAN_N_TT_ILS_RTMIL_OFF (4u)

/** \brief Length for Ifx_CAN_N_TT_ILS_Bits.TTMIL */
#define IFX_CAN_N_TT_ILS_TTMIL_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_ILS_Bits.TTMIL */
#define IFX_CAN_N_TT_ILS_TTMIL_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_ILS_Bits.TTMIL */
#define IFX_CAN_N_TT_ILS_TTMIL_OFF (5u)

/** \brief Length for Ifx_CAN_N_TT_ILS_Bits.SWEL */
#define IFX_CAN_N_TT_ILS_SWEL_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_ILS_Bits.SWEL */
#define IFX_CAN_N_TT_ILS_SWEL_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_ILS_Bits.SWEL */
#define IFX_CAN_N_TT_ILS_SWEL_OFF (6u)

/** \brief Length for Ifx_CAN_N_TT_ILS_Bits.GTWL */
#define IFX_CAN_N_TT_ILS_GTWL_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_ILS_Bits.GTWL */
#define IFX_CAN_N_TT_ILS_GTWL_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_ILS_Bits.GTWL */
#define IFX_CAN_N_TT_ILS_GTWL_OFF (7u)

/** \brief Length for Ifx_CAN_N_TT_ILS_Bits.GTDL */
#define IFX_CAN_N_TT_ILS_GTDL_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_ILS_Bits.GTDL */
#define IFX_CAN_N_TT_ILS_GTDL_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_ILS_Bits.GTDL */
#define IFX_CAN_N_TT_ILS_GTDL_OFF (8u)

/** \brief Length for Ifx_CAN_N_TT_ILS_Bits.GTEL */
#define IFX_CAN_N_TT_ILS_GTEL_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_ILS_Bits.GTEL */
#define IFX_CAN_N_TT_ILS_GTEL_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_ILS_Bits.GTEL */
#define IFX_CAN_N_TT_ILS_GTEL_OFF (9u)

/** \brief Length for Ifx_CAN_N_TT_ILS_Bits.TXUL */
#define IFX_CAN_N_TT_ILS_TXUL_LEN (1u)

