Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_bf.h
/** \brief Mask for Ifx_CAN_N_TT_ILS_Bits.TXUL */
#define IFX_CAN_N_TT_ILS_TXUL_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_ILS_Bits.TXUL */
#define IFX_CAN_N_TT_ILS_TXUL_OFF (10u)

/** \brief Length for Ifx_CAN_N_TT_ILS_Bits.TXOL */
#define IFX_CAN_N_TT_ILS_TXOL_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_ILS_Bits.TXOL */
#define IFX_CAN_N_TT_ILS_TXOL_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_ILS_Bits.TXOL */
#define IFX_CAN_N_TT_ILS_TXOL_OFF (11u)

/** \brief Length for Ifx_CAN_N_TT_ILS_Bits.SE1L */
#define IFX_CAN_N_TT_ILS_SE1L_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_ILS_Bits.SE1L */
#define IFX_CAN_N_TT_ILS_SE1L_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_ILS_Bits.SE1L */
#define IFX_CAN_N_TT_ILS_SE1L_OFF (12u)

/** \brief Length for Ifx_CAN_N_TT_ILS_Bits.SE2L */
#define IFX_CAN_N_TT_ILS_SE2L_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_ILS_Bits.SE2L */
#define IFX_CAN_N_TT_ILS_SE2L_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_ILS_Bits.SE2L */
#define IFX_CAN_N_TT_ILS_SE2L_OFF (13u)

/** \brief Length for Ifx_CAN_N_TT_ILS_Bits.ELCL */
#define IFX_CAN_N_TT_ILS_ELCL_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_ILS_Bits.ELCL */
#define IFX_CAN_N_TT_ILS_ELCL_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_ILS_Bits.ELCL */
#define IFX_CAN_N_TT_ILS_ELCL_OFF (14u)

/** \brief Length for Ifx_CAN_N_TT_ILS_Bits.IWTL */
#define IFX_CAN_N_TT_ILS_IWTL_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_ILS_Bits.IWTL */
#define IFX_CAN_N_TT_ILS_IWTL_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_ILS_Bits.IWTL */
#define IFX_CAN_N_TT_ILS_IWTL_OFF (15u)

/** \brief Length for Ifx_CAN_N_TT_ILS_Bits.WTL */
#define IFX_CAN_N_TT_ILS_WTL_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_ILS_Bits.WTL */
#define IFX_CAN_N_TT_ILS_WTL_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_ILS_Bits.WTL */
#define IFX_CAN_N_TT_ILS_WTL_OFF (16u)

/** \brief Length for Ifx_CAN_N_TT_ILS_Bits.AWL */
#define IFX_CAN_N_TT_ILS_AWL_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_ILS_Bits.AWL */
#define IFX_CAN_N_TT_ILS_AWL_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_ILS_Bits.AWL */
#define IFX_CAN_N_TT_ILS_AWL_OFF (17u)

/** \brief Length for Ifx_CAN_N_TT_ILS_Bits.CERL */
#define IFX_CAN_N_TT_ILS_CERL_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_ILS_Bits.CERL */
#define IFX_CAN_N_TT_ILS_CERL_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_ILS_Bits.CERL */
#define IFX_CAN_N_TT_ILS_CERL_OFF (18u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.EL */
#define IFX_CAN_N_TT_OST_EL_LEN (2u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.EL */
#define IFX_CAN_N_TT_OST_EL_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.EL */
#define IFX_CAN_N_TT_OST_EL_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.MS */
#define IFX_CAN_N_TT_OST_MS_LEN (2u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.MS */
#define IFX_CAN_N_TT_OST_MS_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.MS */
#define IFX_CAN_N_TT_OST_MS_OFF (2u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.SYS */
#define IFX_CAN_N_TT_OST_SYS_LEN (2u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.SYS */
#define IFX_CAN_N_TT_OST_SYS_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.SYS */
#define IFX_CAN_N_TT_OST_SYS_OFF (4u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.QGTP */
#define IFX_CAN_N_TT_OST_QGTP_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.QGTP */
#define IFX_CAN_N_TT_OST_QGTP_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.QGTP */
#define IFX_CAN_N_TT_OST_QGTP_OFF (6u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.QCS */
#define IFX_CAN_N_TT_OST_QCS_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.QCS */
#define IFX_CAN_N_TT_OST_QCS_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.QCS */
#define IFX_CAN_N_TT_OST_QCS_OFF (7u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.RTO */
#define IFX_CAN_N_TT_OST_RTO_LEN (8u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.RTO */
#define IFX_CAN_N_TT_OST_RTO_MSK (0xffu)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.RTO */
#define IFX_CAN_N_TT_OST_RTO_OFF (8u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.WGTD */
#define IFX_CAN_N_TT_OST_WGTD_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.WGTD */
#define IFX_CAN_N_TT_OST_WGTD_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.WGTD */
#define IFX_CAN_N_TT_OST_WGTD_OFF (22u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.GFI */
#define IFX_CAN_N_TT_OST_GFI_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.GFI */
#define IFX_CAN_N_TT_OST_GFI_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.GFI */
#define IFX_CAN_N_TT_OST_GFI_OFF (23u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.TMP */
#define IFX_CAN_N_TT_OST_TMP_LEN (3u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.TMP */
#define IFX_CAN_N_TT_OST_TMP_MSK (0x7u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.TMP */
#define IFX_CAN_N_TT_OST_TMP_OFF (24u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.GSI */
#define IFX_CAN_N_TT_OST_GSI_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.GSI */
#define IFX_CAN_N_TT_OST_GSI_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.GSI */
#define IFX_CAN_N_TT_OST_GSI_OFF (27u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.WFE */
#define IFX_CAN_N_TT_OST_WFE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.WFE */
#define IFX_CAN_N_TT_OST_WFE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.WFE */
#define IFX_CAN_N_TT_OST_WFE_OFF (28u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.AWE */
#define IFX_CAN_N_TT_OST_AWE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.AWE */
#define IFX_CAN_N_TT_OST_AWE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.AWE */
#define IFX_CAN_N_TT_OST_AWE_OFF (29u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.WECS */
#define IFX_CAN_N_TT_OST_WECS_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.WECS */
#define IFX_CAN_N_TT_OST_WECS_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.WECS */
#define IFX_CAN_N_TT_OST_WECS_OFF (30u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.SPL */
#define IFX_CAN_N_TT_OST_SPL_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.SPL */
#define IFX_CAN_N_TT_OST_SPL_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.SPL */
#define IFX_CAN_N_TT_OST_SPL_OFF (31u)

/** \brief Length for Ifx_CAN_N_TT_TURNA_Bits.NAV */
#define IFX_CAN_N_TT_TURNA_NAV_LEN (18u)

/** \brief Mask for Ifx_CAN_N_TT_TURNA_Bits.NAV */
#define IFX_CAN_N_TT_TURNA_NAV_MSK (0x3ffffu)

/** \brief Offset for Ifx_CAN_N_TT_TURNA_Bits.NAV */
#define IFX_CAN_N_TT_TURNA_NAV_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_LGT_Bits.LT */
#define IFX_CAN_N_TT_LGT_LT_LEN (16u)

