Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_bf.h
/** \brief Mask for Ifx_CAN_N_TT_LGT_Bits.LT */
#define IFX_CAN_N_TT_LGT_LT_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_TT_LGT_Bits.LT */
#define IFX_CAN_N_TT_LGT_LT_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_LGT_Bits.GT */
#define IFX_CAN_N_TT_LGT_GT_LEN (16u)

/** \brief Mask for Ifx_CAN_N_TT_LGT_Bits.GT */
#define IFX_CAN_N_TT_LGT_GT_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_TT_LGT_Bits.GT */
#define IFX_CAN_N_TT_LGT_GT_OFF (16u)

/** \brief Length for Ifx_CAN_N_TT_CTC_Bits.CT */
#define IFX_CAN_N_TT_CTC_CT_LEN (16u)

/** \brief Mask for Ifx_CAN_N_TT_CTC_Bits.CT */
#define IFX_CAN_N_TT_CTC_CT_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_TT_CTC_Bits.CT */
#define IFX_CAN_N_TT_CTC_CT_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_CTC_Bits.CC */
#define IFX_CAN_N_TT_CTC_CC_LEN (6u)

/** \brief Mask for Ifx_CAN_N_TT_CTC_Bits.CC */
#define IFX_CAN_N_TT_CTC_CC_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_TT_CTC_Bits.CC */
#define IFX_CAN_N_TT_CTC_CC_OFF (16u)

/** \brief Length for Ifx_CAN_N_TT_CPT_Bits.CCV */
#define IFX_CAN_N_TT_CPT_CCV_LEN (6u)

/** \brief Mask for Ifx_CAN_N_TT_CPT_Bits.CCV */
#define IFX_CAN_N_TT_CPT_CCV_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_TT_CPT_Bits.CCV */
#define IFX_CAN_N_TT_CPT_CCV_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_CPT_Bits.SWV */
#define IFX_CAN_N_TT_CPT_SWV_LEN (16u)

/** \brief Mask for Ifx_CAN_N_TT_CPT_Bits.SWV */
#define IFX_CAN_N_TT_CPT_SWV_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_TT_CPT_Bits.SWV */
#define IFX_CAN_N_TT_CPT_SWV_OFF (16u)

/** \brief Length for Ifx_CAN_N_TT_CSM_Bits.CSM */
#define IFX_CAN_N_TT_CSM_CSM_LEN (16u)

/** \brief Mask for Ifx_CAN_N_TT_CSM_Bits.CSM */
#define IFX_CAN_N_TT_CSM_CSM_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_TT_CSM_Bits.CSM */
#define IFX_CAN_N_TT_CSM_CSM_OFF (0u)

/** \brief Length for Ifx_CAN_STDMSG_S0_Bits.SFID2 */
#define IFX_CAN_STDMSG_S0_SFID2_LEN (11u)

/** \brief Mask for Ifx_CAN_STDMSG_S0_Bits.SFID2 */
#define IFX_CAN_STDMSG_S0_SFID2_MSK (0x0u)

/** \brief Offset for Ifx_CAN_STDMSG_S0_Bits.SFID2 */
#define IFX_CAN_STDMSG_S0_SFID2_OFF (0u)

/** \brief Length for Ifx_CAN_STDMSG_S0_Bits.SFID1 */
#define IFX_CAN_STDMSG_S0_SFID1_LEN (11u)

/** \brief Mask for Ifx_CAN_STDMSG_S0_Bits.SFID1 */
#define IFX_CAN_STDMSG_S0_SFID1_MSK (0x0u)

/** \brief Offset for Ifx_CAN_STDMSG_S0_Bits.SFID1 */
#define IFX_CAN_STDMSG_S0_SFID1_OFF (16u)

/** \brief Length for Ifx_CAN_STDMSG_S0_Bits.SFEC */
#define IFX_CAN_STDMSG_S0_SFEC_LEN (3u)

/** \brief Mask for Ifx_CAN_STDMSG_S0_Bits.SFEC */
#define IFX_CAN_STDMSG_S0_SFEC_MSK (0x0u)

/** \brief Offset for Ifx_CAN_STDMSG_S0_Bits.SFEC */
#define IFX_CAN_STDMSG_S0_SFEC_OFF (27u)

/** \brief Length for Ifx_CAN_STDMSG_S0_Bits.SFT */
#define IFX_CAN_STDMSG_S0_SFT_LEN (2u)

/** \brief Mask for Ifx_CAN_STDMSG_S0_Bits.SFT */
#define IFX_CAN_STDMSG_S0_SFT_MSK (0x0u)

/** \brief Offset for Ifx_CAN_STDMSG_S0_Bits.SFT */
#define IFX_CAN_STDMSG_S0_SFT_OFF (30u)

/** \brief Length for Ifx_CAN_EXTMSG_F0_Bits.EFID1 */
#define IFX_CAN_EXTMSG_F0_EFID1_LEN (29u)

/** \brief Mask for Ifx_CAN_EXTMSG_F0_Bits.EFID1 */
#define IFX_CAN_EXTMSG_F0_EFID1_MSK (0x0u)

/** \brief Offset for Ifx_CAN_EXTMSG_F0_Bits.EFID1 */
#define IFX_CAN_EXTMSG_F0_EFID1_OFF (0u)

/** \brief Length for Ifx_CAN_EXTMSG_F0_Bits.EFEC */
#define IFX_CAN_EXTMSG_F0_EFEC_LEN (3u)

/** \brief Mask for Ifx_CAN_EXTMSG_F0_Bits.EFEC */
#define IFX_CAN_EXTMSG_F0_EFEC_MSK (0x0u)

/** \brief Offset for Ifx_CAN_EXTMSG_F0_Bits.EFEC */
#define IFX_CAN_EXTMSG_F0_EFEC_OFF (29u)

/** \brief Length for Ifx_CAN_EXTMSG_F1_Bits.EFID2 */
#define IFX_CAN_EXTMSG_F1_EFID2_LEN (29u)

/** \brief Mask for Ifx_CAN_EXTMSG_F1_Bits.EFID2 */
#define IFX_CAN_EXTMSG_F1_EFID2_MSK (0x0u)

/** \brief Offset for Ifx_CAN_EXTMSG_F1_Bits.EFID2 */
#define IFX_CAN_EXTMSG_F1_EFID2_OFF (0u)

/** \brief Length for Ifx_CAN_EXTMSG_F1_Bits.EFT */
#define IFX_CAN_EXTMSG_F1_EFT_LEN (2u)

/** \brief Mask for Ifx_CAN_EXTMSG_F1_Bits.EFT */
#define IFX_CAN_EXTMSG_F1_EFT_MSK (0x0u)

/** \brief Offset for Ifx_CAN_EXTMSG_F1_Bits.EFT */
#define IFX_CAN_EXTMSG_F1_EFT_OFF (30u)

/** \brief Length for Ifx_CAN_RXMSG_R0_Bits.ID */
#define IFX_CAN_RXMSG_R0_ID_LEN (29u)

/** \brief Mask for Ifx_CAN_RXMSG_R0_Bits.ID */
#define IFX_CAN_RXMSG_R0_ID_MSK (0x0u)

/** \brief Offset for Ifx_CAN_RXMSG_R0_Bits.ID */
#define IFX_CAN_RXMSG_R0_ID_OFF (0u)

/** \brief Length for Ifx_CAN_RXMSG_R0_Bits.RTR */
#define IFX_CAN_RXMSG_R0_RTR_LEN (1u)

/** \brief Mask for Ifx_CAN_RXMSG_R0_Bits.RTR */
#define IFX_CAN_RXMSG_R0_RTR_MSK (0x0u)

/** \brief Offset for Ifx_CAN_RXMSG_R0_Bits.RTR */
#define IFX_CAN_RXMSG_R0_RTR_OFF (29u)

/** \brief Length for Ifx_CAN_RXMSG_R0_Bits.XTD */
#define IFX_CAN_RXMSG_R0_XTD_LEN (1u)

/** \brief Mask for Ifx_CAN_RXMSG_R0_Bits.XTD */
#define IFX_CAN_RXMSG_R0_XTD_MSK (0x0u)

/** \brief Offset for Ifx_CAN_RXMSG_R0_Bits.XTD */
#define IFX_CAN_RXMSG_R0_XTD_OFF (30u)

/** \brief Length for Ifx_CAN_RXMSG_R0_Bits.ESI */
#define IFX_CAN_RXMSG_R0_ESI_LEN (1u)

/** \brief Mask for Ifx_CAN_RXMSG_R0_Bits.ESI */
#define IFX_CAN_RXMSG_R0_ESI_MSK (0x0u)

/** \brief Offset for Ifx_CAN_RXMSG_R0_Bits.ESI */
#define IFX_CAN_RXMSG_R0_ESI_OFF (31u)

/** \brief Length for Ifx_CAN_RXMSG_R1_Bits.RXTS */
#define IFX_CAN_RXMSG_R1_RXTS_LEN (16u)

/** \brief Mask for Ifx_CAN_RXMSG_R1_Bits.RXTS */
#define IFX_CAN_RXMSG_R1_RXTS_MSK (0x0u)

/** \brief Offset for Ifx_CAN_RXMSG_R1_Bits.RXTS */
#define IFX_CAN_RXMSG_R1_RXTS_OFF (0u)

/** \brief Length for Ifx_CAN_RXMSG_R1_Bits.DLC */
#define IFX_CAN_RXMSG_R1_DLC_LEN (4u)

/** \brief Mask for Ifx_CAN_RXMSG_R1_Bits.DLC */
#define IFX_CAN_RXMSG_R1_DLC_MSK (0x0u)

/** \brief Offset for Ifx_CAN_RXMSG_R1_Bits.DLC */
#define IFX_CAN_RXMSG_R1_DLC_OFF (16u)

/** \brief Length for Ifx_CAN_RXMSG_R1_Bits.BRS */
#define IFX_CAN_RXMSG_R1_BRS_LEN (1u)

/** \brief Mask for Ifx_CAN_RXMSG_R1_Bits.BRS */
#define IFX_CAN_RXMSG_R1_BRS_MSK (0x0u)

/** \brief Offset for Ifx_CAN_RXMSG_R1_Bits.BRS */
#define IFX_CAN_RXMSG_R1_BRS_OFF (20u)

/** \brief Length for Ifx_CAN_RXMSG_R1_Bits.FDF */
#define IFX_CAN_RXMSG_R1_FDF_LEN (1u)

/** \brief Mask for Ifx_CAN_RXMSG_R1_Bits.FDF */
#define IFX_CAN_RXMSG_R1_FDF_MSK (0x0u)

/** \brief Offset for Ifx_CAN_RXMSG_R1_Bits.FDF */
#define IFX_CAN_RXMSG_R1_FDF_OFF (21u)

