Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCan_bf.h
/** \brief Mask for Ifx_CAN_TXMSG_DB_Bits.DB */
#define IFX_CAN_TXMSG_DB_DB_MSK (0x0u)

/** \brief Offset for Ifx_CAN_TXMSG_DB_Bits.DB */
#define IFX_CAN_TXMSG_DB_DB_OFF (0u)

/** \brief Length for Ifx_CAN_TRIGMSG_TM0_Bits.TYPE */
#define IFX_CAN_TRIGMSG_TM0_TYPE_LEN (4u)

/** \brief Mask for Ifx_CAN_TRIGMSG_TM0_Bits.TYPE */
#define IFX_CAN_TRIGMSG_TM0_TYPE_MSK (0x0u)

/** \brief Offset for Ifx_CAN_TRIGMSG_TM0_Bits.TYPE */
#define IFX_CAN_TRIGMSG_TM0_TYPE_OFF (0u)

/** \brief Length for Ifx_CAN_TRIGMSG_TM0_Bits.TMEX */
#define IFX_CAN_TRIGMSG_TM0_TMEX_LEN (1u)

/** \brief Mask for Ifx_CAN_TRIGMSG_TM0_Bits.TMEX */
#define IFX_CAN_TRIGMSG_TM0_TMEX_MSK (0x0u)

/** \brief Offset for Ifx_CAN_TRIGMSG_TM0_Bits.TMEX */
#define IFX_CAN_TRIGMSG_TM0_TMEX_OFF (4u)

/** \brief Length for Ifx_CAN_TRIGMSG_TM0_Bits.TMIN */
#define IFX_CAN_TRIGMSG_TM0_TMIN_LEN (1u)

/** \brief Mask for Ifx_CAN_TRIGMSG_TM0_Bits.TMIN */
#define IFX_CAN_TRIGMSG_TM0_TMIN_MSK (0x0u)

/** \brief Offset for Ifx_CAN_TRIGMSG_TM0_Bits.TMIN */
#define IFX_CAN_TRIGMSG_TM0_TMIN_OFF (5u)

/** \brief Length for Ifx_CAN_TRIGMSG_TM0_Bits.R6 */
#define IFX_CAN_TRIGMSG_TM0_R6_LEN (2u)

/** \brief Mask for Ifx_CAN_TRIGMSG_TM0_Bits.R6 */
#define IFX_CAN_TRIGMSG_TM0_R6_MSK (0x0u)

/** \brief Offset for Ifx_CAN_TRIGMSG_TM0_Bits.R6 */
#define IFX_CAN_TRIGMSG_TM0_R6_OFF (6u)

/** \brief Length for Ifx_CAN_TRIGMSG_TM0_Bits.CC */
#define IFX_CAN_TRIGMSG_TM0_CC_LEN (7u)

/** \brief Mask for Ifx_CAN_TRIGMSG_TM0_Bits.CC */
#define IFX_CAN_TRIGMSG_TM0_CC_MSK (0x0u)

/** \brief Offset for Ifx_CAN_TRIGMSG_TM0_Bits.CC */
#define IFX_CAN_TRIGMSG_TM0_CC_OFF (8u)

/** \brief Length for Ifx_CAN_TRIGMSG_TM0_Bits.R15 */
#define IFX_CAN_TRIGMSG_TM0_R15_LEN (1u)

/** \brief Mask for Ifx_CAN_TRIGMSG_TM0_Bits.R15 */
#define IFX_CAN_TRIGMSG_TM0_R15_MSK (0x0u)

/** \brief Offset for Ifx_CAN_TRIGMSG_TM0_Bits.R15 */
#define IFX_CAN_TRIGMSG_TM0_R15_OFF (15u)

/** \brief Length for Ifx_CAN_TRIGMSG_TM0_Bits.TM */
#define IFX_CAN_TRIGMSG_TM0_TM_LEN (16u)

/** \brief Mask for Ifx_CAN_TRIGMSG_TM0_Bits.TM */
#define IFX_CAN_TRIGMSG_TM0_TM_MSK (0x0u)

/** \brief Offset for Ifx_CAN_TRIGMSG_TM0_Bits.TM */
#define IFX_CAN_TRIGMSG_TM0_TM_OFF (16u)

/** \brief Length for Ifx_CAN_TRIGMSG_TM1_Bits.MSC */
#define IFX_CAN_TRIGMSG_TM1_MSC_LEN (3u)

/** \brief Mask for Ifx_CAN_TRIGMSG_TM1_Bits.MSC */
#define IFX_CAN_TRIGMSG_TM1_MSC_MSK (0x0u)

/** \brief Offset for Ifx_CAN_TRIGMSG_TM1_Bits.MSC */
#define IFX_CAN_TRIGMSG_TM1_MSC_OFF (0u)

/** \brief Length for Ifx_CAN_TRIGMSG_TM1_Bits.MMR */
#define IFX_CAN_TRIGMSG_TM1_MMR_LEN (7u)

/** \brief Mask for Ifx_CAN_TRIGMSG_TM1_Bits.MMR */
#define IFX_CAN_TRIGMSG_TM1_MMR_MSK (0x0u)

/** \brief Offset for Ifx_CAN_TRIGMSG_TM1_Bits.MMR */
#define IFX_CAN_TRIGMSG_TM1_MMR_OFF (16u)

/** \brief Length for Ifx_CAN_TRIGMSG_TM1_Bits.FTYPE */
#define IFX_CAN_TRIGMSG_TM1_FTYPE_LEN (1u)

/** \brief Mask for Ifx_CAN_TRIGMSG_TM1_Bits.FTYPE */
#define IFX_CAN_TRIGMSG_TM1_FTYPE_MSK (0x0u)

/** \brief Offset for Ifx_CAN_TRIGMSG_TM1_Bits.FTYPE */
#define IFX_CAN_TRIGMSG_TM1_FTYPE_OFF (23u)

/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCAN_BF_H */
